[[{"body": "\nOnly ordered 2 entrees and an appetizer, and they forgot an entree.\n", "rating": -1, "title": "Couldn't get our take-out order correct", "author": "dhudock19", "source": "urbanspoon", "time": "1432517748", "id": "1707097"}, {"body": "\nGreen Curry Lenguini\n-\nJust Awesome, doesn't even need the clams\n", "rating": -1, "title": "Green Curry Lenguini", "author": "52RU", "source": "urbanspoon", "time": "1428249103", "id": "1707097"}, {"body": "\nThe Pork Belly Sliders are to die for!!! The broth in the Love Boat noodles was super flavorful with just enough spice. I chose level 2 (medium) and it goes up to 5 (crazy hot). I went for lunch this time. Next time I'm going for dinner and BYOB and want to try the spicy pig wings. Affordable, nice portions, friendly staff, relaxing atmosphere!\n", "rating": -1, "title": "Yummy", "author": "knapper540", "source": "urbanspoon", "time": "1427481491", "id": "1707097"}, {"body": "\nSimply said, fabulous!\n", "rating": -1, "title": "Mobile review", "author": "Deb Woodford", "source": "urbanspoon", "time": "1425754941", "id": "1707097"}, {"body": "\nIts a beautiful restaurant with nice decor. We got the pork sticky buns as an appetizer and they were absolutely delicious, we were so excited to get our main meal after tasting them. We ordered pad thai, when you order you have to choose a spice level from 1-5. I'm a wimp so I got a 1 but I'll tell you...I couldn't even eat it! It was SO spicy! My throat and lips were on fire after 3 bites. It's really unfortunate because I think it would have been delicious. I guess I should have ordered a 0 or ask if they can not add any spice but I never thought a 1 could be that spicy. I would try this place again and ask for no spice because I think it would have been delicious. Just a warning to the other spice wimps out there!!\n", "rating": -1, "title": "Beware of the spice level!", "author": "mollylukedds", "source": "urbanspoon", "time": "1389550351", "id": "1707097"}, {"body": "\nYou absolutely must try this place. The chiang mai curry is phenomenal. And they're not messing around when they give you a spicy scale of 1-5...the 5 will make you cry. So good!! One of my favorite places in shady side.\n", "rating": -1, "title": "Mobile review", "author": "Kayla Cox", "source": "urbanspoon", "time": "1388786928", "id": "1707097"}, {"body": "\nAbsolutely amazing. The food is delicious, but watch how you order the heat of your meal. My favorite is the chai Mai curry\n", "rating": -1, "title": "Mobile review", "author": "Kath", "source": "urbanspoon", "time": "1386027896", "id": "1707097"}, {"body": "\nGot the chicken see yew for lunch today and it was great..got a level 3 spicyness but prob could have gone with a 1 or 2..ppl aren't kidding about the spice here. Went on my lunch break and got take out..I wished I could have called ahead to order but it only took about 10 min for my food to come out..overall very good and I'll def be back\n", "rating": -1, "title": "Mobile review", "author": "Laura", "source": "urbanspoon", "time": "1389807304", "id": "1707097"}, {"body": "\nTried Noodlehead today for the first time and it was excellent. We were there in the middle of the afternoon and it was relatively busy but we didn't have to wait for a seat. The Pad Thai, Street Noodles #2 and Beef Soup were well presented and flavorful. We will definitely return.\n", "rating": -1, "title": "Mobile review", "author": "PghUrbanFoodie", "source": "urbanspoon", "time": "1385259505", "id": "1707097"}, {"body": "\nFirst time there. Gread decor. Good service. The noodle bowls were priced well ($9). That was more than enough food for lunch. I will definitely be going back.\n", "rating": -1, "title": "Mobile review", "author": "jon", "source": "urbanspoon", "time": "1385432062", "id": "1707097"}, {"body": "\nNoodles are tasty. Had the tempura shrimp....somewhere, pretty tiny. A little bit of Bok Choy and a few strings of Cilantro. Should have been more. I have to say service is just......FaIr. Packed Place of Pittsburgh Palates, Pontificating Pretensiously. Watta ya want fer $9.00?\n", "rating": -1, "title": "Tasty spicy noodles", "author": "smith", "source": "urbanspoon", "time": "1400426937", "id": "1707097"}, {"body": "\ngreat little place, like the decorating.food is good, well priced and quick!\n", "rating": -1, "title": "thumbs up", "author": "yamaha6611", "source": "urbanspoon", "time": "1394056841", "id": "1707097"}, {"body": "\nOur favorite restaurant. Amazing and consistent food, fast, super reasonable pricing and overall really great atmosphere... We love it and go about every two weeks. Steamed buns app are SO GOOD!\n", "rating": -1, "title": "Mobile review", "author": "BooShark", "source": "urbanspoon", "time": "1390674260", "id": "1707097"}, {"body": "\nI don't venture to a ton of ethnic restaurants so I didn't know what to expect, but this had to be one of the best meals I have ever had. The dish was the size of my head and despite filling up quickly, it was so delicious I ate the entire serving in one sitting. I loved the the option to choose how spicy I wanted my meal. This feature allows one to change the same dish a little every time.The restaurant is BYOB so if you're looking to get a cheap buzz on, buzz away. I recommend a nice bottle of wine. The charge is quite minimum for the bottle fee. On top of everything, the atmosphere is also quite lovely.Only bugaboo: it's cash only and they won't typically seat you until your entire party is there.\n", "rating": -1, "title": "And...Then I Fell in Love.", "author": "stac10131013", "source": "urbanspoon", "time": "1419951030", "id": "1707097"}, {"body": "\nThe curry noodles are delicious! I love ethnic food and have eaten at a lot of Thai, Vietnamese, and Indian restaurants. Lots to compare to. The noodles are soooooo good (creamy and hot) and rate at the top of my list.\n", "rating": -1, "title": "favorite curry noodles", "author": "bobbipr", "source": "urbanspoon", "time": "1391176729", "id": "1707097"}, {"body": "\nThe only way to enjoy everything is to bring 2 to 4 pals and just order everything......wine and beer with the best of Thai food .......my fave is the lollipop\n", "rating": -1, "title": "BYOB and cash= a great night out!", "author": "Brat from the slopes", "source": "urbanspoon", "time": "1410047050", "id": "1707097"}, {"body": "\nAwesome food!!! Must try!!!! You won't be disappointed!!!\n", "rating": -1, "title": "Mobile review", "author": "Olivia V.", "source": "urbanspoon", "time": "1394932386", "id": "1707097"}, {"body": "\npleasantly surprised by this place... great food and fun location to come with a small group of people... remember it is cash only!\n", "rating": -1, "title": "Good cheap eats", "author": "ASRoma58", "source": "urbanspoon", "time": "1418918812", "id": "1707097"}, {"body": "\nThe Kee Mao noodles with Tofu were excellent. Got my spice level at a 4 and got the exact heat I expected. Be careful you non chili heads, you may have to stay around a 2 for safety reasons. The sticky pork buns are great as many say and the atmosphere is bustling and fresh. BYOB fits here because it's nothing like have great food and exactly what you prefer to drink. Can't wait to go back.\n", "rating": -1, "title": "Loved it", "author": "TasteofLife412", "source": "urbanspoon", "time": "1391729229", "id": "1707097"}, {"body": "\nOn our first visit to Noodlehead, my wife and I tried 2 snack dishes and 3 noodle dishes. Everything was delicious and our expectations for top notch, flavorful Asian food were exceeded! The Pork Belly Steamed Buns, Sweet and Spicy Pig Wings, and Chiang Mai Curry Noodles will keep us coming back for more.\n", "rating": -1, "title": "Mobile review", "author": "RunPGH", "source": "urbanspoon", "time": "1410044620", "id": "1707097"}], [{"body": "\nBest Bloody Mary bar anywhere. Waiter knowledgable about gluten free options. Everyone's food was excellent. Highly recommend !\n", "rating": -1, "title": "Gluten free options available!", "author": "Lilycat", "source": "urbanspoon", "time": "1432480222", "id": "1595486"}, {"body": "\nWell, as suggested I made reservations. However, to get a reservation at a 5:30 I had to make it 4 weeks out. We were about 20 minutes early so we checked in and told the hostess that we were going to be at the bar to get a drink, until our table was ready. My wife was exited to check out the Bloody Mary Bar for $5.00, that we’ve heard so much about. The bar tender proceeded to tell us that the bloody Mary bar is only for lunch, but he could make her one. So a Bloody Mary and a Jack and Coke came to $22.00 plus tip. Ouch! That was a bit more than we were expecting but we were out on the town and just wanted to have a good time and enjoy ourselves. So 5:30 came and went and we still didn’t get a table. So about 5:45 I went back out to the hostess stand and asked about our 5:30 reservation. They told me it would be another few minutes. So we finally get a seat right next to the corner of the bar. The problem is that it was so narrow between the bar and my chair every time somebody went by they would bump into my chair or me. So I asked out waiter if we could move over one table. He did allow us, so that was good. So my wife is sitting against the wall on like a big long velour couch and I was sitting in a velour chair across from her. She was complaining how uncomfortable she was, and so was I at this point. Both of our seats felt like the springs were blown out and we were sitting in a hole. The velour upholstery was all stained up and looked filthy. The mirrors on the wall looked filthy at first, but then I realized they were just old pitted. With all of the high ratings, despite the tiny tables, I was expecting better. So as an appetizer we ordered the bone marrow and mushroom risotto. Both were very good I must say. For our main course I ordered the Hudson Valley Duck Breast and my wife ordered the Wagyu Flat Iron. We both ordered them medium rare as recommended by our waiter. My Duck breast was very chewy and gristly, even after I trimmed off what looked fat and gristle. I couldn’t even find a piece that I didn’t have to spit out after a few minutes of chewing. My wife gave me some of her Wagyu Flat Iron to eat instead. It wasn’t bad but defiantly didn’t seem like Wagyu beef. I didn’t complain though, I just wanted to get out of the uncomfortable chair I was sitting in and go home. Our waiter asked what was wrong with my dinner because I obviously didn’t eat it. So I told him it was very chewy and gristly. He said that was one their signature dishes and after talking to his manager, he took my dinner off of our check. The service from our waiter was good so he got a nice tip, but as for the restaurant, we were very disappointed.\n", "rating": -1, "title": "Disappointing Experience", "author": "John", "source": "urbanspoon", "time": "1427367983", "id": "1595486"}, {"body": "\nCreative genius in regards to all facets of this restaurant. Wonderful food, perfected cocktails, beautiful desserts - well rounded experience.\n", "rating": -1, "title": "Great experience", "author": "equal4all412", "source": "urbanspoon", "time": "1425738376", "id": "1595486"}, {"body": "\nCreative genius in regards to all facets of this restaurant. Wonderful food, perfected cocktails, beautiful desserts - well rounded experience.\n", "rating": -1, "title": "Outstanding", "author": "equal4all412", "source": "urbanspoon", "time": "1425737747", "id": "1595486"}, {"body": "\nyou'd think by now M&P; would have it down pat? they are always busy. good food still but the menu selection is far too small....sat at a 4 top on a saturday night. took one hour from order to get our food. why? the waiter apologized to us. i have heard from several people its better to sit at the bar if you want to eat which in reality should not have to be the case. speaking of which, avoid the far side of the bar unless you like wait staff CONSTANTLY bumping you in the back. the aisle is far too narrow because the dining chairs are living room sized and should be replaced with smaller seating. someone didnt have a laser when they measured this restaurant?\n", "rating": -1, "title": "ssssssssssssssslow service.... why?", "author": "tuco", "source": "urbanspoon", "time": "1410536080", "id": "1595486"}, {"body": "\nWasn't too bad. Wasn't the best meal I've ever had, but wasn't the worst. Not in a hurry to go back.\n", "rating": -1, "title": "SO SO", "author": "joey8195", "source": "urbanspoon", "time": "1422595696", "id": "1595486"}, {"body": "\n(11/10/2014) Heard a lot about Meat and Potatoes, was mentioned in Bon Appetit's article about Pittsburgh being the next big food city. We arrived close to 10pm on a Monday night, place was bustling, very loud (DJ spinning tunes in the corner, luckily in my age group), full of the pretty people here to see and be seen. A large bar hogs up most of the main room, a circular dining area rings it. Place is dimly lit, beautiful dark wood and cast iron, marble and mirrors, like a 19th century parlor. We were seated towards the end of the bar at an unfortunate turn in the dining room. Overflow from the bar made passage pretty tight. Dimwit hostess tried to seat another group between us, either she gave up trying to make me move into oncoming traffic or the incoming guests decided (wisely to ask for another table). The place pretty much filled to the gills, then I realized, duh, Monday night late menu special \"Night Cap\" (starts at 10pm). Cocktails, Prohibition-era, were the best of the night (this was stop #6 on a self-guided restaurant crawl of downtown Pittsburgh). My friend had the 25th Hour (subbed vodka), I had the Southie; both made great use of herb and spice liqueurs for subtle accents. Since I knew we were headed this way, saved myself for the Bone Marrow. An enormous tray arrive with 2 large marrow bones split in half and stacked. Accoutrements were classic and perfectly matched to cut the unctuousness of the marrow (pickled onion, parsley, sea salt, capers). We devoured the top two, they were phenomenal. The bottom two were unfortunately cold (as much of a carnivore as I am, cold marrow is totally gross). Also had the Devils on Horseback, jumbo Medjool dates stuffed with chorizo, wrapped with bacon and broiled. Very tasty, touch overwhelming on the dates for me (maybe use a smaller date?). The menu is not, shall we say, \"lite\", but hey, you didn't expect that from a place called \"Meat and Potatoes\" did you. I can see why the place has turned heads.\n", "rating": -1, "title": "Hipsters do ersatz speakeasy cool", "author": "A.C.", "source": "urbanspoon", "time": "1416196837", "id": "1595486"}, {"body": "\nHave eaten there many times, lunch and dinner. Went there on a Sunday for our anniversary. Waitress was terrible. Took about 10 minutes till she noticed we were there and no it was no crowded yet...never told is the specials...ordered the devils on horseback, cold, nasty. Our dinners were cold, had the fish in a sauce and the sauce was almost jelled when it finally made it to our table. Ordered a Cosmo and got grapefruit and gin, really????? Had to adjust our check 3 times, each time higher, $140, $170 and finally $185. BAD, BAD, BADI complained and they sent a gift card. No idea of the value, called to ask and was told I need to use it to find out...I don't think so\n", "rating": -1, "title": "Doubt we will go back", "author": "virginia1002", "source": "urbanspoon", "time": "1417374308", "id": "1595486"}, {"body": "\nDelicious meal at a unique restaurant with a unique menu! Has a funky nightclub vibe that might put some first-timers off. Go for the food and the party. Not for a quiet romantic dinner. The Steak Tartare appetizer was one of the best I have ever had!\n", "rating": -1, "title": "Mobile review", "author": "Drew S", "source": "urbanspoon", "time": "1421676508", "id": "1595486"}, {"body": "\nBut great cocktails, sitting at the bar is a treat because the bartenders are great and will talk to you about various liquors and life in general. I loved our bartender on V-day b/c he took time to describe some things that I could do when making cocktails at home! Also, if you're like me and don't eat pork or red meat (usually) you aren't out of luck. Their fried brussels are to die for. The best bar snack ever, and at $5 won't break the bank. Fried chicken livers are great too, but a little too heavy... I might get these instead of a meal next time! They always have a lovely fish dish and they have been very accommodating when I've brought along friends who had restricted diets. Most amazingly is that their aiolis are delicious. I absolutely hate mayo, but unlike most restaurants they aren't just modifying some cheap hellman's mayo and making their own mayo/aioli/whatever you call it.\n", "rating": -1, "title": "Not just meat and potatoes", "author": "Callie", "source": "urbanspoon", "time": "1393451409", "id": "1595486"}, {"body": "\nMake a reservation because this place is so good it's the only way to get a table. This restaurant is excellent and is putting the hurt on several downtown restaurants that have gotten away with crappy food and service. We ate breakfast at the bar and the food and service was perfect.\n", "rating": -1, "title": "Mobile review", "author": "Todd Wion", "source": "urbanspoon", "time": "1409700271", "id": "1595486"}, {"body": "\nNo, they don't serve sardines, but that is what you will feel like in this too cramped restaurant. Tiny little tables do not work when meals are served on a cutting board. We ordered the meat and potatoes for 2, and every time I tried to cut the steak, the people next to us had to move out of the way. We could not eat off of plates because they would not fit!Steak was good, not great. Loved the confit potatoes and mushrooms. Bone marrow was a big let down. Hardly any was in there, and to add insult I had to pay $3 more for bread to put it on!So many better places to eat in Pittsburgh!\n", "rating": -1, "title": "Meat & Sardines", "author": "Mimi", "source": "urbanspoon", "time": "1398976477", "id": "1595486"}, {"body": "\nI've been to Meat & Potatoes multiple times and have never been disappointed. I highly recommend the hanger steak, the burgers, and the fried brussels. The decor is hip and the vibe is noisy and alive which makes it a very fun spot for cocktails as well.\n", "rating": -1, "title": "Great!", "author": "Dining Diva", "source": "urbanspoon", "time": "1389831774", "id": "1595486"}, {"body": "\nFood was original and great tasting. Main dining area small but has great decor. Back dining room could be dressed up more. Very pleased overall\n", "rating": -1, "title": "Mobile review", "author": "Mike Strawn ", "source": "urbanspoon", "time": "1414583927", "id": "1595486"}, {"body": "\nI agree with most of the good reviews of Meat and Potatoes. It`s a fun place with good food. We`ve been there many times and enjoyed the food very much. The hanger steak is our favorite and the mussels wonderful and plentiful. However, the drinks on our last few visits were so weak I complained. When we mentioned the problem, the next drink was a good glass of bourbon. However, this weekend our drinks were bad. There wasn`t enough alcohol in the glass for 2 sips. Has anyone else noticed this problem?\n", "rating": -1, "title": "What about the drinks.", "author": "foodiejeanie", "source": "urbanspoon", "time": "1395585088", "id": "1595486"}, {"body": "\nMy husband and I really enjoyed our meal at Meat and Potatoes. I would return soon to enjoy the mussels again. He had a pasta dish, and he said that it was fabulous! We were with a group and received our food in a timely manner in time to make our show commitments. I will be returning soon!!!\n", "rating": -1, "title": "Loved the mussels!", "author": "Joan Altman", "source": "urbanspoon", "time": "1413638752", "id": "1595486"}, {"body": "\nI have been to both Sunday brunch and late night shindigs at Meat & Potatoes many, many times. The brunch selection has a refreshing selection of internationally-influenced breakfasts, and gourmet takes on American classics. And the bloody mary bar? Check out the liquor infusions of the day (jalapeno tequila is a favorite of mine) and get creative with the buffet options for your morning drink! This is one of my favorite Pittsburgh brunch traditions.The cocktails and wines are also great in the evening, with a small but quality beer selection. Great bar snacks, and a great place to meet up with friends. I highly recommend making reservations well ahead of time on almost any night of the week, especially if there is an event happening downtown or in the theatre district.\n", "rating": -1, "title": "Favorite Pittsburgh Brunch", "author": "Cassie Kay", "source": "urbanspoon", "time": "1390978637", "id": "1595486"}, {"body": "\nI'm not a huge steak fan, but I thought since this is a steak place, I'd get one. I had the Wagyu flat iron with pickles and it was excellent. It was done just the way I like it and the sherry sauce added a really nice flavor. Nice atmosphere and friendly staff.\n", "rating": -1, "title": "Enjoyed it", "author": "scottro67", "source": "urbanspoon", "time": "1407108479", "id": "1595486"}, {"body": "\nCouldn't wait to try Meat & Potatoes brunch based on most of the reviews. Needless to say, I was slightly disappointed. Our table was ready on time. Staff seemed kinda stuffy but friendly. Food was not memorable. I was expecting more for my palette and wallet. We had Grilled Mahi with Quinoa cake. Quinoa was cold which I wasn't expecting. Mahi was good. But lacked a flavor. Homemade granola with ricotta was very good. French toast was just that and just ok. I feel this is just a trendy joint rather than a foodie experience!\n", "rating": -1, "title": "Mobile review", "author": "Glenfoodie", "source": "urbanspoon", "time": "1391392384", "id": "1595486"}, {"body": "\nGreat service, food, and atmosphereHighly recommend\n", "rating": -1, "title": "Mobile review", "author": "Beakenator", "source": "urbanspoon", "time": "1424223280", "id": "1595486"}], [{"body": "\nSteak is perfectly cooked medium rare over a wood-fired grill, and thrown on a thick ciabatta bun with red peppers n onions and your choice of an Argentinian sauce. Hanger is my favorite when they got rid of the skirt. Love the flank, strip, and ribeye too. Easily in my top 3 sandwiches ever.\n", "rating": -1, "title": "Top of the Game", "author": "Dellerbills ", "source": "urbanspoon", "time": "1430616077", "id": "1729706"}, {"body": "\nThis is WITHOUT DOUBT the best restaurant in Pittsburgh...if you're a fan of open flame wood-fired meats, veggies, breads etc there is no where else to go. I'm a steak lover and I've yet to find a better one...anywhere. Heads up though, restaurant is super small, barstool only seating, though the patio in nice weather is awesome...you won't regret it.\n", "rating": -1, "title": "Mobile review", "author": "Adam Hamed", "source": "urbanspoon", "time": "1428460354", "id": "1729706"}, {"body": "\nWe had an uncharacteristically early supper last night, and I'm glad we did, as Gaucho was nearly out of food as it prepared to close for several weeks in order to expand into the building next door. Dinner was a delight as we shared a small (but ample) portion of seared strip steak and braised beef, with a small side of grilled veg. We hope to be the FIRST diners at Gaucho when they reopen.\n", "rating": -1, "title": "Last diners before closing for renovation", "author": "Rod Rillette", "source": "urbanspoon", "time": "1428239355", "id": "1729706"}, {"body": "\nThis place is incredible. I ordered the carne sandwich with filet, peppers, and onions. It was easily the best sandwich I've ever eaten with flavorful, perfectly cooked meat and just the right amount of charred smoky flavor. My lunch mate ordered the rosemary braised beef and said he didn't want it to end it was that good. The staff were friendly and the place has a cool vibe, BUT this place is insanely busy so go in with the right expectation of how long it's going to take to get in and out. We arrived for weekday lunch at about 11:30 and didn't order until almost 12:30. The line was well out onto the sidewalk. Not necessarily bad unless you're in a hurry, but we went with it, had our food to go and enjoyed every bite. Go here- I promise you will be glad you did!\n", "rating": -1, "title": "Mobile review", "author": "LuluKoala", "source": "urbanspoon", "time": "1427995773", "id": "1729706"}, {"body": "\nThe reviews don't lie! Hop on in and get a heavenly sandwich, slather it in those wonderful sauces and chat up the friendly staff!\n", "rating": -1, "title": "Incredible.", "author": "Rachel Geraci", "source": "urbanspoon", "time": "1426046211", "id": "1729706"}, {"body": "\nMy initial visit August of 2014 went well. The cuisine was flavorful and well prepared. My subsequent visits have been below average. Flank steak was extremely leathery, and salad contained sub-rate veggies to say it politely. Will not go back... Would not recommend to others.\n", "rating": -1, "title": "Mobile review", "author": "tom", "source": "urbanspoon", "time": "1425166786", "id": "1729706"}, {"body": "\nThis is a place that gets it right every time. They make wonderful grilled meats, fish, and veggies, cooked on hard wood. The flavor is wonderful and the doneness is consistent. They keep the customers coming because they produce the same quality and experience over and over.\n", "rating": -1, "title": "Execution and consistency!", "author": "Bruce Beckerman", "source": "urbanspoon", "time": "1425324647", "id": "1729706"}, {"body": "\nAhh, the smell is so nice as you walk up to the door. Arouses the senses and gets the old mouth a-watering. The wood was stacked under the counters so not much leg room if you sit at a stool. It does get a little crowded at lunch time. The service is extra friendly and helpful. Order your meal and select from the four condimentos. All very good and interesting. Nothing real spicy, just some great flavors. The special was a grilled braised beef with carmelized onions and some horseradish sauce. Just a treat! Had a side of chunks of potato that were cooked perfectly and had some spices for flavor. The grilled veggies looked great, Next time!\n", "rating": -1, "title": "Wood-Fired Sandwich", "author": "Effort", "source": "urbanspoon", "time": "1389983584", "id": "1729706"}, {"body": "\nI stopped in at Gaucho for an afternoon lunch with my husband. We have been to Argentina and have had the fabulous gaucho meats there and were excited to see what this place in Pgh had to offer. It met and exceeded our expectations. When we walked in, it was packed. The staff was so friendly and welcoming. It was like an experience, like a party with new friends, not just a lunch. The chefs were \"in the weeds\" so they politely said there would be a 10 to 15 minute wait, but free wine or beer to the patrons during that time. It was their 1 year anniversary the day before and they were still celebrating! We had some wine and waited and watched the other patrons delight in their meals as our mouths watered waiting our turn. It was worth the short wait! We ordered the asado, a gaucho salad, the chorizo, camarones, provaleta and vegetables. Man. The caramelized onions! The beef - all of it delicious! The best part, really, was the atmosphere - singing, kindness, welcoming, friendly - and that energy shined in the amazing food. :)\n", "rating": -1, "title": "Yum!", "author": "shawnelle6", "source": "urbanspoon", "time": "1391896140", "id": "1729706"}, {"body": "\nThis is by far my favorite place in all of Pittsburgh. The food is spectacular. The meats are delicious. Everything there will get your tastebuds popping. If Bordain came to Pittsburgh, he'd marvel over this quaint little carnivore's delight.\n", "rating": -1, "title": "Simply the Best", "author": "Jason", "source": "urbanspoon", "time": "1415651355", "id": "1729706"}, {"body": "\nUnbelievable sauces and skirt steak. Wow. I'm Latin American born and raised and this place is amazing.\n", "rating": -1, "title": "Mobile review", "author": "Laura ", "source": "urbanspoon", "time": "1390326437", "id": "1729706"}, {"body": "\nDon't let the small place fool you! EVERYTHING was excellent and there is so much to try, a bit pricey but more than worth it. I'll certainly return\n", "rating": -1, "title": "Mobile review", "author": "adam", "source": "urbanspoon", "time": "1413304992", "id": "1729706"}, {"body": "\nAside from Peter Lugers in Brooklyn this is the best steak I've ever had. Intense sauces, onion, garlic, pimenton and chimmichurri enhance the intense flavor of the charred but rare meat. Inexpensive and fabulous. I wish I lived in Pittsburgh so I could eat here all the time.\n", "rating": -1, "title": "Crusty juicy flavorful meat", "author": "caroledowling", "source": "urbanspoon", "time": "1409094366", "id": "1729706"}, {"body": "\nI had the hanger steak sandwich, potatoes and grilled vegetables. The steak was the best that I've had in recent memory. Full of flavor and grilled/smoke on a very good roll. The vegs were really good, too. I was ready to do it again, right after finishing. Friendly, knowledgeable staff. I'm already looking forward to returning.\n", "rating": -1, "title": "A wonderful spot.", "author": "henry", "source": "urbanspoon", "time": "1415999143", "id": "1729706"}, {"body": "\nMy pal and I stopped into Gaucho on a COLD Friday night. We brought 4 bottled beers to split, as Gaucho is fantastically BYOB. Uninterestingly enough, we both ended up ordering the same sandwich: Steak Sandwich (with NY Strip), with the onions and peppers and chimichurri. Regardless of our lack of variety in ordering, the sandwich was pretty killer. There was a little bit of fat in my cut, so next time, I'd probably go for the skirt or flank to have the fat more evenly cooked into the bite. We also got potatoes and empanadas to split. Both were tasty, and went well with the 4 sauces Gaucho offers.Be wary! There are like 8 seats in the place in the winter. We were lucky enough to get there early and grab a seat along the wall. I bucket this place in a category like Green Forest Churrascaria, but better. Where Green Forest is an expensive dinner of $40+ with similar food, but all-you-can-eat, Gaucho gives you a focused taste. You don't need to spend $40 to eat steak done 10 ways when you can drop $12 on a sandwich with steak cooked perfectly, with fantastic toppings, and nicely portioned. The true debate was which topping was the best. Between the garlic, the onion, the pepper, or the chimichurri, they all were fantastic.Awesome place! I hope they grow, because the concept and execution is superb.\n", "rating": -1, "title": "Tiny Place, BIG Flavor", "author": "SweetBabyJay", "source": "urbanspoon", "time": "1390933030", "id": "1729706"}, {"body": "\nGaucho is a cozy eatery with an outstanding array of menu items. I didn't see one microwave when I was in there. There is a wood-fired grill going all day. The food is freshly made, no shortcuts here. I went in and got the sandwiches cut in half and switched halves with a co-worker. I had a half of a braised beef (brisket) sandwich, half of a hanger steak sandwich. Shrimp appetizer. The sandwiches were excellent and perfectly cooked. Fresh ingredients. The shrimp was well seasoned and tasty. I would go back again, and again, and again.\n", "rating": -1, "title": "Outstanding", "author": "Lemongrass", "source": "urbanspoon", "time": "1423247338", "id": "1729706"}, {"body": "\nGreat stuff. We loved the pimenton.\n", "rating": -1, "title": "Mobile review", "author": "Alex", "source": "urbanspoon", "time": "1405225580", "id": "1729706"}, {"body": "\nThis was delicious food. Friendly, helpful chef at the register. There are only bar stools. No tables. I'll be back, this time for take out.\n", "rating": -1, "title": "Great food, no dining room", "author": "Greg", "source": "urbanspoon", "time": "1392168399", "id": "1729706"}, {"body": "\nEverything tried so far has been fantastic. The grilled corn on the cob pairs well with the side sauces offered on a table near the register. If you like food, you will like this place.\n", "rating": -1, "title": "Favorite lunch in the strip", "author": "Emily", "source": "urbanspoon", "time": "1401840055", "id": "1729706"}, {"body": "\nFound this place in Pittsburg on one of my road trips. Their grilled vegetables, corn and sandwiches are amazing and the sauces are superb. Would recommend it to everybody!\n", "rating": -1, "title": "Amazing grill", "author": "gepi_s", "source": "urbanspoon", "time": "1403733702", "id": "1729706"}], [{"body": "\nNicky's was absolutely delicious! Great variety of food all at a great price...I can see why the place is so busy! Take it from me...reservations are necessary! I will definitely be back! :-)\n", "rating": -1, "title": "Fabulous experience!", "author": "Julie", "source": "urbanspoon", "time": "1398301360", "id": "766886"}, {"body": "\nSome of the best spicy noodles I've ever had! Great experience!\n", "rating": -1, "title": "Mobile review", "author": "Nate Dogg", "source": "urbanspoon", "time": "1401055765", "id": "766886"}, {"body": "\nBest Thai food in Pittsburgh, hands down. Friendly staff. Delicious, fresh food. Love the outside garden in warm weather. Love the neighborhood on the North Side too.It can get busy & it's very small so that can be the one downside. But truly, the Thai food is EXCEPTIONAL. A must try!\n", "rating": -1, "title": "A delightful place to eat!", "author": "Layla", "source": "urbanspoon", "time": "1409419713", "id": "766886"}, {"body": "\nBasil\n-\nIt was so good!! Great flavor and presentation. The cheese wonton was a great touch. The #7 spicy on a 1-10 scale was spicy enough without overpowering the good flavor. Even the carrot garnish was fantastic. Just a great dish!!\n", "rating": -1, "title": "Basil", "author": "Mike Brown", "source": "urbanspoon", "time": "1412825344", "id": "766886"}, {"body": "\nSome of the best Thai I've ever eaten! Went for lunch and started off with the chicken noodle soup. Light, fresh and perfectly seasoned. Chicken Black for my entree and it was amazing! Visually perfect and that brown sauce, I could seriously have licked it off my plate. Service was fine, considering it was a busy time and no empty tables the entire time we were there. The small interior space is pretty and nicely decorated and my only complaint is the notice level. Ouch! You practically have to scream to talk to your lunch companion. As wonderful as the meal was, I think I will wait till the outside seating area is open for my next visit.\n", "rating": -1, "title": "Mobile review", "author": "Spoken Like a Queen", "source": "urbanspoon", "time": "1396036627", "id": "766886"}, {"body": "\nFirst time trying Thai Food and the experience was delicious, quaint atmosphere, prompt service and a large portion for a small price. Customer service made you feel like royalty! Will be back again!!\n", "rating": -1, "title": "Amazing Experience", "author": "LiLone", "source": "urbanspoon", "time": "1396439677", "id": "766886"}, {"body": "\nTom Yum Soup\n-\nMy favorite soup.\n", "rating": -1, "title": "Tom Yum Soup", "author": "Lisa B", "source": "urbanspoon", "time": "1413667260", "id": "766886"}, {"body": "\nWe celebrated our anniversary with a dinner at Nicky's Thai Kitchen yesterday evening. They were not able to find our reservation (I called 2 days earlier) but were still able to seat us outside on time. We brought a reisling to accompany our dinner. My red curry with chicken was deliciously spicy (I chose a 7 for spiciness). Our service was just okay. The flavor of my dinner more than made up for it! This was our second visit and we will return to sit outside on their lovely patio!\n", "rating": -1, "title": "Mobile review", "author": "LuvSpice", "source": "urbanspoon", "time": "1401649905", "id": "766886"}, {"body": "\nI once order for dinner and had lunch there. dinner time was good, really good. the pad se ew, very nice. i no like lunch menu. i think very expensive, and things were not good because im vegetarian, and they give me chicken. they say sorry, but i was in a hurry so i eat anyway. i dont feel very good later.\n", "rating": -1, "title": "leave me high and dry", "author": "Huangpu Chowdown", "source": "urbanspoon", "time": "1392768530", "id": "766886"}, {"body": "\nNO! I was so excited to try Nicky's, and I love Thai food, but this is terrible. I just got takeout and my food was inedible! I got Pad Thai, it had zero spice and was without any kind of sauce. Just a bunch of clear noodles? It smelled really fishy (I got chicken) and like vinegar. What!? After a few bites, it tasted like something was bad. Like, spoiled, rotten. I felt bad but I had to throw it all away. Disgusting. I'm very upset because it was not cheap and I was looking forward to it.\n", "rating": -1, "title": "Mobile review", "author": "love lindsay", "source": "urbanspoon", "time": "1395618917", "id": "766886"}, {"body": "\nMy friend, me, and our two sons dined here tonight with a 5:30 pm reservation. We waited 15-20 minutes to be seated as the dining room is extremely small and most patrons had just ordered or had their food delivered.Once seated we ordered chicken satay $7.50 for my son--he liked it but said it was not consistently cooked through-out as it was tough in some parts. I ordered the Thom Kha Soup $4.50 and well worth the price. Its made with coconut milk and I requested chicken. Very tasty with a generous bowl you can make it a meal. I also tried the chicken black $13.95 which came with brown sauce and mushrooms. The brown sauce was extremely salty and my chicken was cut up in big chunks, small chunks, and shreaded pieces. Would appreciate some consistency with bite size chicken pieces if that is not too much to ask. My friend's son had fried rice with chicken which he liked and don't remember the name of the chicken dish my friend had but she also said it was salty.We had jasmine hot tea to drink in a small ceramic tea pot with a tea bag infused in hot water. It was very weak. Would appreciate a pot of tea in a larger stainless steal pot with BREWED tea. I don't believe asking for brewed tea in a thai restaurant is unreasonable.Overall, I give the food 3 stars out of 5 (just average). Would have been four if they would brew their tea and use salt in moderation.\n", "rating": -1, "title": "Nicky's Thai SALTY Kitchen", "author": "jocee", "source": "urbanspoon", "time": "1390197038", "id": "766886"}, {"body": "\nWhere bullets fly? Really! Get a life. That area is as safe as any other area in Pittsburgh. Western Avenue has been completely redone with new sidewalks, street lights, building facades. The food at Nicky's is great! It's all freshly made so it's not always consistent. Sometimes things may be a little more sweet, other times more spicy. The patio is beautiful once the weather permits it being open. I'll attach a picture of the horrible crime infested street that does not exist.\n", "rating": -1, "title": "Where bullets fly?", "author": "Frank", "source": "urbanspoon", "time": "1304681610", "id": "766886"}, {"body": "\none of the best kept secrets in the burgh! amazing value!carreful though, the neighbors in this area are know for dog fighting, prostitution and hit and run accidents.\n", "rating": -1, "title": "you wont be let down!!!!", "author": "Ryan Knows Restaurants", "source": "urbanspoon", "time": "1276617487", "id": "766886"}, {"body": "\nCute little place that has fairly huge entree portions. I ordered the app sampler and was very pleased; one or two of the thai toasts were a little chewy but the presentation, sauces, and quality of the rest more than made up for it. Everyone at the table was happy with their meal too. If I'm ever stuck in the North Side in need of Thai food again I will definitely return.\n", "rating": -1, "title": "tasty food!", "author": "Melissa", "source": "urbanspoon", "time": "1298081939", "id": "766886"}, {"body": "\nGinger Fish Hold the Mushrooms\n-\nGood things do come in small packages! Although getting to be seated is a little tricky it is well worth the squeeze and/or wait...Everything about Nicky's was great! I went for lunch. The presentation of the food was good, the spice was just right I ordered a 7 but my families from NAWRLENS (New Orleans that is). I like it spicy. I've been looking for a great Thai restaurant in Pittsburgh for 15 years and I do believe I've find one. I shall return!\n", "rating": -1, "title": "Mmmm mmmm good!", "author": "D Maximillion Elliott-Quinerly", "source": "urbanspoon", "time": "1371156804", "id": "766886"}, {"body": "\nWe've been going to Nicky's for years. It's one of - if not THE - best Thai you'll find in the area. We've been to Tamari (not true Thai at all), Sweet Basil, Thyphoon and the new Thai place out at Robinson. I think the difference is in the fresh ingredients, really accurate heat level and the fact that Nicky's is not sloppy/generous with sauces. I recommend the Param Chicken, Poor Man's Beef, Pad Thai, and the Tom Yum Soup. If you visit in the summer, YOU MUST SIT OUTSIDE. You'll feel like you're on vacation. It's BYOB too, with no corkage fee. Nicky, himself, is a class act, and you can tell he puts a lot of time and attention into the food preparation.\n", "rating": -1, "title": "Truly authentic Thai food", "author": "Lucy", "source": "urbanspoon", "time": "1328557721", "id": "766886"}, {"body": "\nExcellent food and quick friendly service.\n", "rating": -1, "title": "Mobile review", "author": "Jay", "source": "urbanspoon", "time": "1337126127", "id": "766886"}, {"body": "\nCashew with Tofu\n-\nI can’t even find the words to explain how great this place is. We went over the weekend for my birthday, and the entire staff went beyond expectations to make it memorable. They surprised me with cake, sang happy birthday, and were just friendly & super attentive. Not to mention the food was excellent. I got the cashew entree with tofu. level 3 spicy. Level 3 was just right for me, and trust me, is being a low number still had a kick. It was perfect, I can't wait to go back and try all the different things on the menu. Being vegan/vegetarian this place was such a find!We also sat outside in the garden. Though it is small, you kind of forget about the size. They burned incense which smelled wonderful, the BYOB policy is also really nice. We finished off 3 bottles of wine between 6 of us, and them splitting the corkage fee made it barely noticeable on the bill. This is the place you want to go, where you want to take your visitors coming from out of town. Date night, Birthdays, or even take out. This is it.\n", "rating": -1, "title": "Amazing & More", "author": "ReginaGeorge", "source": "urbanspoon", "time": "1376914146", "id": "766886"}, {"body": "\nMandy, my adventurous daughter, and I decided to try NIcky's prior to attending a Pirates game and were very pleased with our decision. I enjoyed the fresh spring roll appetizer, taking greater pleasure in Nicky's sliced serving over the usual presentations offered elsewhere. Two entree's were ordered and thoroughly enjoyed. Black chicken and red curry. Nicky's black chicken dish was an earthy tasting dish of chicken with mushrooms in a brown sauce with bites of varying degrees of flavor. The red curry a wonderful medley of spice intermingled with coconut milk and herbs. So many different tastes and textures working in harmony. \"I can taste all the seperate flavors, they aren't just mashed together\" is what Mandy kept telling me. I second that motion. It all just feels so good together.\n", "rating": -1, "title": "A pleasant surprise!", "author": "MARK", "source": "urbanspoon", "time": "1282100542", "id": "766886"}, {"body": "\nBest Thai in Pittsburgh BUT...The good:Lovely embiance outside. BYOB = A+++The best thai food I've had in Pittsburgh.Service was good but not above and beyond. Best dish we had: Pad see ewAlso recommend: spicy green beens, crab rangoon, and green curryThe bad:Food was overly spicy! Maybe we just had a chef who decided to add more heat than usual but I didnt read any complaints about the food being too spicy. One reviewer said 9 was preffered which would kill any regular palate. I consider myself to have a high tolerance to spicy food and my green curry which was a number 7 was painful! Use caution! For the typical Pittsburgh palate I dont recommend ordering anything over number 5. Nicky's could try placing spicy condiments on the table like other thai restaurants and avoid this whole number confusion. How is anyone going there for the first time supposed to know how spicy their 1 to 10 scale is?What we had:The best dish all around was pad see ew. No complaints at all. Next was the green curry which had good flavor despite the spice but the chicken was hard and dry with an odd green (read: artificial) color. More eggplant would have been nice.Also good were the spicy green beens, actually the least spicy of all despite the name but the beans were too crunchy. One more minute of cooking would have taken that squeeky crunch out of them. Crab rangoon was good but i didnt taste any crab - is it even supposed to have crab? It didnt matter because they were terrific.Overall i would definitely go back armed with the knowledge of their spiciness. There are so many things on the menu i would like to try. I encourage you to do the same!\n", "rating": -1, "title": "Mobile review", "author": "Jason", "source": "urbanspoon", "time": "1378407199", "id": "766886"}], [{"body": "\nSMOKE didn't miss a beat when they reopened in Lawrenceville. They're still BYOB and happen to be next to a craft beer bottleshop right on Butler St. I always have trouble only picking 3 tacos, but my starting lineup would be the Chicken Apple, Pork, and Ribs. Don't forget about the Queso with homemade pita scoops or the White Cheddar Mac, and do yourself a favor and add bacon!!\n", "rating": -1, "title": "Revival Tastes Even Better", "author": "Dellerbills ", "source": "urbanspoon", "time": "1430453162", "id": "1597860"}, {"body": "\nI tasted the chorizo taco & brisket taco and the mac n cheese,,,,, heaven on the buds! The rest of the party had the Migas, veggie taco and the chicken taco. AWSOME! The service was great with a lot of smiles! Thank you!\n", "rating": -1, "title": "#1 stop in Lawrenceville for the greatest tacos!", "author": "markmatasich", "source": "urbanspoon", "time": "1428886620", "id": "1597860"}, {"body": "\nMiss Smoke in Homestead dearly. Drove to L-ville last night. 1 hr wait even after our 1 hr being on the wait list. Very cold inside the restaurant so that was uncomfortable. I hope it will be cool in summer and they aren't just going to rely on opening the doors! However, the food did not disappoint --- it was delish (although prices are bit higher than I remember)! Note to management: you need a sign and street # on the front of the building!!\n", "rating": -1, "title": "Hmmmm", "author": "mag1254", "source": "urbanspoon", "time": "1427639308", "id": "1597860"}, {"body": "\nWonderful service and food!!!! Management is great and friendly. Welcome the new location.....bigger and better!!! Good job\n", "rating": -1, "title": "Mobile review", "author": "Pghpartee", "source": "urbanspoon", "time": "1429035965", "id": "1597860"}, {"body": "\n1. I came and it was closed because they had NO FOOD!!!2. Waited an hour and a half to be told \"sorry we can't seat your party because now we are closing in 5 minutes\"3. Another time Waited 45 minutes to be told yet again \" sorry we can't seat you we will be closing soon but I guess you can do take out\" 4. Waited twenty minutes longer then we were supposed to because host seated a friend who walked in right before we were about to be satMoral of the story don't risk waiting too long or you won't get food\n", "rating": -1, "title": "great food horrible service", "author": "mariaht14", "source": "urbanspoon", "time": "1424997431", "id": "1597860"}, {"body": "\nFinally! The new space is phenomenal, and we didn't think the food could get any better, but....It did! Had the rib taco and the brisket taco - Outstanding. Also had the slaw and the black beans, so fresh and tasty. They know how to cook. Really. Thanks.\n", "rating": -1, "title": "Finally - we missed you!", "author": "Hatti", "source": "urbanspoon", "time": "1427026511", "id": "1597860"}, {"body": "\nIf you don't like waiting a long time for food, don't bother. If you don't like waiting a long time to get seated, don't go during peak dining hours ( but still expect a 20 minute wait). If you forgot to BYOB, there's a bottle shop next door. The Mac is a revelation. The apple jalapeno slaw is tasty that isn't very heavy on the jalapeno. The tacos are pricey but come loaded with protein and toppings. There's specials to keep things interesting. Will definitely return.\n", "rating": -1, "title": "Mobile review", "author": "hellopals", "source": "urbanspoon", "time": "1425767149", "id": "1597860"}, {"body": "\nBrisket Taco\n-\nThe Smoke in Lawrencevillle is a delight. Check in and leave your cell number as always a wait. pop next door and select beer or cider from the two story Atlas Bottleworks and get it chilled, wander down to Eild Card and bores til your call. A delightful night begins with cheesy dip, pita crackers, brisket tacos to die for and a great slaw to temper the heat. Great place, service and cannot wait to go back for that Mac n chees goodness on other tables\n", "rating": -1, "title": "The Brisket Taco Sings!❤️❤️", "author": "Brat from the slopes", "source": "urbanspoon", "time": "1425042951", "id": "1597860"}, {"body": "\nThe food here is amazing. We will drive there just for the apple jalapeño cole slaw! If you are ever at the waterfront, don't eat there, go to SMOKE!\n", "rating": -1, "title": "Mobile review", "author": "Poli", "source": "urbanspoon", "time": "1401776991", "id": "1597860"}, {"body": "\nJust went there for the 1st time last night and thought it was amazing. The little place was packed, but luckily we got the last available seats. the food took a really long time to arrive, but it was worth the wait. My husband and I shared 4 tacos (they suggested 2 per person) and the mac and cheese. I loved all the tacos. If I had to rank them I would say: brisket, ribs, pork, chorizo. All of them were slightly to very spicy. I found the mac a perfect compliment. It was like ranch with chicken wings. Finally as we were getting ready to go we ordered two of their cookies (chocolate chip + pistachio and chocolate chip + peanut butter) to go. I ate them later and they were amazing. This place is in a very weird location, and it was pretty far from where I live, but I would definitely make the trip again.\n", "rating": -1, "title": "Worth the trip and wait.", "author": "nshark", "source": "urbanspoon", "time": "1388854417", "id": "1597860"}, {"body": "\nCoolest, best and most unique place in the greater burgh! They are doing what they do, and reinventing a cuisine. If you havent tried this place, go, like soon! Take your own beverage of choice, and take cash. ENJOY!\n", "rating": -1, "title": "Mobile review", "author": "food-lifer", "source": "urbanspoon", "time": "1391021905", "id": "1597860"}, {"body": "\nMy wife went here on my birthday because I love tacos. She was told 30 minutes for her order. 30 minutes went by and she was curious. They told her that her order never made it to the kitchen and it would be 25 minutes more. How do they not comp the bill or at least give her a discount? Wanted to try the food but chalk this one up to no thank you.\n", "rating": -1, "title": "poor service", "author": "mdkneebone", "source": "urbanspoon", "time": "1426285304", "id": "1597860"}, {"body": "\nI've been a few times, and have tried almost everything on the menu. It is all so, so delicious. The duck quesadilla is literally to die for. The mac and cheese... incredible. The PORK TACO... I swoon. Even the veggie and bean taco would make Anthony Bourdain make an inappropriate comment about eating and watching porn at the same time, and he is equivocally against any food lacking meat. Do yourself a favor and head to SMOKE, it is worth the wait and will NOT disappoint. Just remember they are closed Mo-We. I was jonesing for tacos one Monday night, arrived, and heard a very, very sad trombone playing in my head when I saw they were closed.PS. It's BYO and they have an awesome old school refrigerator to keep your booze in while you wait! Quality stuff.\n", "rating": -1, "title": "A.Maz.Ing.", "author": "Jenn B", "source": "urbanspoon", "time": "1392085184", "id": "1597860"}, {"body": "\nFood was great but, after being told it would be a 45 min wait, it ended up being 2 hours and 15 min. and instead of calling and notifying us (with the number we gave them to call us when our table was ready since its too small and there is nowhere to wait} I had to go in 3 times and being told it would be 20 more min each time. Probably won't go back until they move into a bigger place in a better neighborhood. Food is fantastic though. Just no place is worth waiting over 2 hours in a crap town\n", "rating": -1, "title": "Great Food/Bad Location", "author": "Rick Falvo", "source": "urbanspoon", "time": "1392576357", "id": "1597860"}, {"body": "\nAn hour wait for tacos! Tacos, people, by their very definition are fast food. I don't care how flipping tasty they may be. I guess shame on my husband and I for trying to go out to eat on an early Friday evening with our well behaved toddler and sleeping newborn. We went early on purpose so we wouldn't wreck anyone else's evening out with cranky kids. But even I was cranky after 45 minutes of waiting for our food with no munchies to snack on. I had to go find our server to ask for my son's chicken taco - he was starving! Again, these are tacos you're making folks not cassoulet. If you only want college students, childless yuppies, and hipsters dining at your restaurant then keep up the good work. If you don't want kids there, that's honestly fine, just be straight and tell parents when they walk in that they'll have to wait an hour for a single taco and they will surely turn around and walk out. I hate writing bad reviews and I love seeing new and interesting restaurants in my beloved Pittsburgh but give me a freaking break. Even if my husband and I hadn't gone here with our kids, we still would've been upset with a wait time like that for our food. Plus, we ended up spending $50!! How'd that happen - for food wrapped in foil! If you'd like folks to hang out and take their time, make the dining space a little more comfortable and perhaps block the door so that your guests aren't hit with a polar vortex every time somebody walks in. As a waitress for 15 years I feel qualified to comment on the service, which was sort of friendly but inept. I won't head here again, even for takeout, considering what other reviewers said about wait times for that. Not even on date night. Keep your delicious tacos, (the spice overpowers the flavor anyway) I'll be at Mad Mex.\n", "rating": -1, "title": "Mobile review", "author": "Elizabeth", "source": "urbanspoon", "time": "1391825969", "id": "1597860"}, {"body": "\nI heard a rumor that Smoke had moved to Lawernceville. To anyone that has been recently, is this true?\n", "rating": -1, "title": "Is it in Lawernceville?", "author": "jorange47711", "source": "urbanspoon", "time": "1393279541", "id": "1597860"}, {"body": "\nAfter reading others' reviews I was worried about the service and wait, but my husband and I arrived at 5:00 PM on a Friday and we were immediately seated. Our food was served within 15 minutes! The prices are totally justified as well. Portions are very hearty, and everything here is made in-house including the smoked meats and tortillas. Both of the sides we ordered, the mac & cheese with bacon and the jalepeno apple slaw, were amazing. The fresh strawberry infused water was the perfect compliment to our meal. I may never eat a regular Philly cheesesteak again after eating one in taco form. A must try!\n", "rating": -1, "title": "Easily one of my favorite new restaurants in Pittsburgh.", "author": "Nicole", "source": "urbanspoon", "time": "1334247241", "id": "1597860"}, {"body": "\nLet's start with the good. I tried three kinds of tacos: brisket, pulled pork, and chicken. They all immediately rank among the best tacos I've ever had. The meat in each is carefully and perfectly cooked. The juiciness and flavor is so profound that no cheese or fixings is needed. And the tortilla is...perfect. The brisket and pulled pork were both delicious. The latter featured a few big, thick strips of tender pork, not the tong-full of pork soup that usually goes into tacos and burritos. (which I enjoy very much, don't get me wrong) But what really knocked my proverbial socks off (Proverbs 4:18.. \"Yay, and he who shall taste the Taco, shall thus have his slippers shot forth from his feet\") was the chicken taco. The best chicken taco (or burrito) I've ever eaten...easily. Hell, I don't even really know what was on it, but it was remarkable.Secondary good points.. the interior is funky and charming. They have old doors re-purposed to support the counter; I thought that was kinda cool. The pretty gal (owner?) at the counter was super friendly. Ok, let's go negative for minute.I ordered three tacos. It took 35 minutes. Seriously. I'd read that the service was slow, but I still have to figure this is an aberration. I loved the food so much, I wanted to leave the place with only raves. But the more I thought about it, it's pretty crazy that it took that long. There was only one table of four before me. And despite all her helpfulness and friendliness, the lady never said a thing about it taking so long. Oh, and there's no AC. A long wait only seems longer on a hot day like yesterday.As good as it was...and it was....my 3 tacos and a drink came to about $14. And they aren't very big. I can attach several kind terms to Smoke, but \"Good Value\" isn't one of them.I will most definitely be back. The food is too good to boycott the place just because I had to wait too long my first time. Oh, and pictures of their food really don't do it any favors. It just looks like meat on a tortilla. Because it is. What the picture doesn't capture, though, is each ingredient being masterfully brought to its damn near full potential.\n", "rating": -1, "title": "Transcendental Tacos", "author": "SammyPittsburgh", "source": "urbanspoon", "time": "1311314852", "id": "1597860"}, {"body": "\nI really like Smoke. I do. Their food is AMAZING. So delicious! If you go there when it's not very busy, you get great service & the food comes out fast. But once it gets busy? Forget it. You will not get a refill on your drink, no one will check on you, you will wait 30-50 minutes for your food, there will be people standing all around you waiting for tables... it's not a pleasant experience. Also, they are cash only (which I HATE) & they usually ring up your food wrong. I've been overcharged by a few bucks twice. My friend was shortchanged today during the dinner rush. I know it's not on purpose but seriously, they need more employees. Once they get crowded, it's absolute mayhem in there. And the prices are a bit high. I paid almost $18 today for two tacos, a side of mac-n-cheese & a glass of water. But the food? Simply fantastic.\n", "rating": -1, "title": "Delicious food but...", "author": "Vivienne", "source": "urbanspoon", "time": "1343953773", "id": "1597860"}, {"body": "\nIf you like tacos and BBQ it is a great place. A must try! Not a destination for a large party or sit down dinner. Very limited seating but the Owners are working on it they said. For a couple, great place for a bite or our suggestion is get 4 or 5 tacos and smuggle them into the AMC theatre! Amazing amazing brisket!\n", "rating": -1, "title": "Great food", "author": "Kitty and wolf", "source": "urbanspoon", "time": "1316867528", "id": "1597860"}], [{"body": "\n1st off the man with bad accent is the owner needs to go back to Italy 2nd off your talk to customers the way u do 3rd you need to fix the problem if and order is wrong you don't hand the same plate and then a side of sausage and make the customer put it in there eggs and then you get smart with me .we got there at 1120am on May 25 2015 and the lady comes to our table and takes our order at 1125am so we wait patiently for our food to realize the lady hasn't put it in since 1150 says our food will be right out 1210 then comes back 10 mins later and says sorry we're behind so we had to wait 15 more mins by then it was over an hour and I talked to the owner about bad serve and said bob's diner has better service and then he said well next time go to bob's diner it's like he wanted to lose all his customers bad resturAnt really bad\n", "rating": -1, "title": "Mobile review", "author": "Anne Zabel", "source": "urbanspoon", "time": "1432673755", "id": "1674640"}, {"body": "\nThe food was good, I ordered breakfast. Instead of a big breakfast meal I had to order everything separate which ended up costing me $30 just for my own meal. A bit pricey but still I enjoyed it. As for the title of my review, the first time I went to Central Diner I was literally two bites into my meal when the waitress came over and asked if I wanted to take the rest home. She had to of been the most ignorant waitress I have ever encountered, and I am a pleasant customer and to top it off I tip at least 30%, but not to a server who has an attitude and gives poor performance for no foreseeable reason. I used to be a busser, waiter and bar tender so I know service and do not expect the world. I even clean up after myself to help the staff, I stack all the dishes to make whoever cleans my table job easier, again I used to do the job so I know what it's like. My second visit, yes I went back after experiencing the waitress from hell, my server was not ignorant like the first, but she never smiled, never asked if I wanted a refill, as a matter of fact she never said a whole sentence. She came to my table said \"what can I get you\" and that was the only time she spoke. After that I have not went back. I read the review of the owner yelling at the staff, in my opinion, if he was yelling at either one of the servers I had, he should do it more often. I know the industry, I know all too well what it is like to deal with the public, the 'service' I received on both trips to Central Diner, the second trip was poor, but the first was down right ignorant and inexcusable. A tip to all servers out there:: I know not every customer tips, I know some customers are ignorant, but there are those customers like myself that are always pleasant and tip VERY well, so you have no one but yourself to blame when I leave a single dollar or even a single penny as your tip to show you what a lousy job you have done. Earn it, which is extremely easy to do because I do not expect much, or find another job because when I go out to eat I expect to have a pleasant time, not deal with your attitude and poor service, if that's the case I can serve myself and tip myself.\n", "rating": -1, "title": "Depends on the server", "author": "bktacy", "source": "urbanspoon", "time": "1432657568", "id": "1674640"}, {"body": "\nAfter reading all the great reviews, this was the place for mothers day. But I had a different experience. Put us outside in the sun, (mums 83) ok, guest of honor orders pouched eggs over corn beef hash, got hard boiled eggs over sunlamp hash, it was like meatloaf. She` s a trooper tho, thx god for bloody Mary, it made meatloaf palatable. you think two eggs over would be easy, nope, two eggs running faster then me, shouldn't hush browns have some brown in them? shouldn`t toast be toasted? Oh well, hope you had different experience.\n", "rating": -1, "title": "Mothers Day", "author": "charles15214", "source": "urbanspoon", "time": "1431296321", "id": "1674640"}, {"body": "\nour dinner experience was SUPER NICE...our server LAUREN M couldn't have been more attentive and more gracious during our meal! She was wonderful and very knowledgeable about all of the menu items....she kept us well hydrated and fed during our time at the central grille.....this is not our first time there...we've been here before and each time we depart with a very full stomach and beautiful memories of our experience at your restaurant....KUDOS to the owners, managers, wait staff, and most importantly the KITCHEN employees!!!! HATS OFF to all....thank you for making our mother's day get together memorable!Jack Eichner\n", "rating": -1, "title": "Mother's day get together!!!!!", "author": "ike5255", "source": "urbanspoon", "time": "1431293439", "id": "1674640"}, {"body": "\nGreat lunch-very good value. Great waitress.\n", "rating": -1, "title": "Mobile review", "author": "Jenny", "source": "urbanspoon", "time": "1429390513", "id": "1674640"}, {"body": "\nCentral Diner & Grill has the BEST rice pudding!!\n", "rating": -1, "title": "Dessert", "author": "tfasciani", "source": "urbanspoon", "time": "1430052417", "id": "1674640"}, {"body": "\nIt seems like everyone has been to this place. Central's decor seemed a little nicer than most diners, more of a family restaurant. Our service was OK. Someone in management or the owner did stop by to talk and see if everything was good. The food - you get large portions, fries are good, cole slaw was OK, the Greek chicken panini was OK, chicken was not real tasty and a little overcooked. Probably should have had a breakfast item based on what I have heard.\n", "rating": -1, "title": "Another Diner", "author": "Effort", "source": "urbanspoon", "time": "1426854640", "id": "1674640"}, {"body": "\nWe live in Steubenville, OH (35 miles to the west) and come up to Robinson at least once or twice a week.We always stop at the \"DINER\" for dinner. It's clean, food is great, coleslaw is \"out of this world\", and the desserts are awesome. So happy there is finally a restaurant that is not a chain corp. and something differentwith a great atmosphere. Staff is friendly, too ! Thanks Central Diner & Grille, we will continue to patronize you whenever we come to Robinson.\n", "rating": -1, "title": "Love It !!!", "author": "rbudash", "source": "urbanspoon", "time": "1427370571", "id": "1674640"}, {"body": "\nIt was amazing. Everything a restaurant ought to be. Clean, bright, fast service...best of all PIPING HOT FOOD. My mixed drinks were perfection as was the food. Nice style. I'm going to make my kitchen the same color palette.\n", "rating": -1, "title": "AMAZING", "author": "partial2poodles", "source": "urbanspoon", "time": "1425951741", "id": "1674640"}, {"body": "\nMore always isn't better. Very busy diner, service was good. The menu is very large which always is a red flag to me. The Greek salad was very good, however the main dishes were mediocre at best. Chicken Parmesan overlooked very thin which ended up crispy hard chicken covered in a ton of melted cheese. Chicken Athena was flavorless. Grape leaves we're mushy. Hamburger was meh. Took leftovers home and ended up throwing it away. It seems too busy and mass producing meals in which the quality suffers.\n", "rating": -1, "title": "Mobile review", "author": "Lucy", "source": "urbanspoon", "time": "1429061905", "id": "1674640"}, {"body": "\nAre you ever hungry and not quite sure what you want? Then this is the answer! The Central diner is what you would expect from a diner style restaurant and way more. It really is not your typical diner, but one that has elevated to the status of a \"foodie favorite\". Sure you can get a great traditional breakfast, lunch or dinner that will satisfy anyone in your party's craving because the menu covers it all and with a hint Greek favorites as a bonus. But the menu here offers so many options like the traditional favorites, but they also daily specials as well as unique options you will not find at your typical diner establishment.Breakfast is a favorite here when we are planning a day of shopping. It is a great way to start the day. Forget the chain restaurants that are surrounding the area, unless you want mediocre food. Go here and try a different daily special. You won't be disappointed.My only complaint is that I don't live close enough to stop here more often to be able to try even more items they offer. I want to try just about anything in their bakery case. Just looking at some of the cakes and goodies is truly a delight! The cakes are amazing!The restaurant itself is designed in a contemporary style and tastefully decorated. The service is fast and efficient. The restaurant is very clean and can be very busy at times. Prices are reasonable for an upscale diner.This has become a favorite of ours and is added to our list of \"go to\" places when in the area. Do yourself a favor and \"go there\" too!\n", "rating": -1, "title": "What do you want to eat?", "author": "mickeymotto77", "source": "urbanspoon", "time": "1421525245", "id": "1674640"}, {"body": "\nGreat place. Better than most of the Greek diners in the NYC area. The staff is personable and the owner runs a well oiled operation. I've been there for breakfast, dinner and late night and the food was great at all hours. Usually diners with as extensive a menu as Central sacrifice quality over quantity but the portions are big, tasty and very well priced. If you like Greek food sample theirs. Its authentic. Bravo.\n", "rating": -1, "title": "Truly a Great Greek Diner", "author": "Thaddeus", "source": "urbanspoon", "time": "1399162630", "id": "1674640"}, {"body": "\nBeen here a couple of times now and very impressed with the service, staff, quality and food. We are regulars at Kelly O's on the strip which this compares equally as well to on the breakfast front. Love the fact that the manager or owner come's round to check all is ok even on very busy services. They provide top notch customer service. It will become a regular spot for us.\n", "rating": -1, "title": "Great place for breakfast, lunch or diner", "author": "Scottish Foodie", "source": "urbanspoon", "time": "1406495779", "id": "1674640"}, {"body": "\nHad the Western Omelet there on two occasions. It was excellent, loved the home fries! Service was great. Can't wait to go back again.\n", "rating": -1, "title": "Jan", "author": "zarakitty11", "source": "urbanspoon", "time": "1422646538", "id": "1674640"}, {"body": "\nNot your typical \"diner\"! This restaurant was formerly a Denny's location and was completely renovated from top to bottom. The result is a modern looking restaurant that is about as far away from your stereotypical diner as you can get! This place is seriously beautiful. The food at Central Grille is great and the menu is huge for a restaurant/\"Diner\" of this size. They have a great selection of home cooked foods (meatloaf, chicken parm, stuffed peppers) and also a ton of authentic Greek-style dishes (gyros, moussaka). As can be expected from a place touting itself as a \"diner\", they also have delicious breakfast! The portions are seriously gigantic. I think the meatloaf comes with 4 big pieces of meatloaf and 2 or 3 sides (all for under $11!), so you'll almost certainly be taking home leftovers to enjoy later! The service is great, I have never had an issue with anything. The two men who appear to run the place are extremely friendly. The owner is an older gentleman who is always giving his employees a helping hand and there is also a younger man (I assume he's the manager) who always makes it a point to stop by the table to make sure everything is going well. I've probably eaten here 10-15 times and these guys have been here every time, so it is clear they really have a passion for their work and this restaurant.\n", "rating": -1, "title": "Great Food, Huge Portions & Friendly Service!", "author": "gangrlrulz", "source": "urbanspoon", "time": "1418063944", "id": "1674640"}, {"body": "\nThis was the first restaurant we went to the day we moved to Robinson and it quickly became our go-to restaurant! We absolutely love it! The management is friendly and the owner is very involved and always around greeting the guests. I recommend their Greek yogurt - it is amazing! Thick and creamy, a million times better than anything you'll find in a store. Ugggh I just love this place!\n", "rating": -1, "title": "Mobile review", "author": "JG", "source": "urbanspoon", "time": "1418092369", "id": "1674640"}, {"body": "\nThe food is awesome! I love this place!!!\n", "rating": -1, "title": "Mobile review", "author": "First Mate", "source": "urbanspoon", "time": "1388857846", "id": "1674640"}, {"body": "\nGreat meal, terrific service, huge portions, & very family friendly! We love everything about this restaurant.\n", "rating": -1, "title": "Mobile review", "author": "Stumblina", "source": "urbanspoon", "time": "1395540201", "id": "1674640"}, {"body": "\nAs someone who lives in the Robinson area, this restaurant is a welcome change to all the plentiful chain restaurants and mediocre food. Usually we have to drive to the south hills, north hills, etc. to get some original cooking or Mom and Pop establishments...thank goodness!\n", "rating": -1, "title": "Mobile review", "author": "Sam's Mom", "source": "urbanspoon", "time": "1420734181", "id": "1674640"}, {"body": "\nI had driven by this place a million times and finally went in a few months ago. It quickly became my favorite lunch spot. While I normally sit at the counter, over the weekend my parents came in from out of town and I knew it was the perfect place to take them. It was pretty busy since it was Good Friday, but our waitress was so friendly and attentive. My parents loved the selection, and the portions were HUGE. I normally get the same thing every time (the chicken parm sandwich). The sandwich is massive, I usually make two meals of it. The french fries are perfect, my mouth is watering a little just thinking about them. My parents both got lunch specials (stuffed peppers and shepherds pie). They opted for salad over soup and had them with the diner's homemade greek dressing since the waitress recommended it. They were over the moon. With the salad there was some delicious bread, which my parents loved since they got saucy dishes and the bread was perfect to soak some of it up. They were raving about how good everything was as they ate, and each enjoyed their dishes so much they opted not to offer anyone more than a bite to taste it (a rare occurrence). We were absolutely stuffed by the end of lunch and now my favorite lunch spot is now one of my parents favorite lunch spots! I'll definitely be taking them back when they come for their next visit.\n", "rating": -1, "title": "Great Lunch Spot", "author": "DerbyDawn", "source": "urbanspoon", "time": "1398526810", "id": "1674640"}], [{"body": "\nWent to have a burger today and specfically asked the waitress how accurate the chef was on \"doness\". \"Oh he over cooks everthing \".So I thought thanks for the honesty so of I want it med rare she chimes in \"ask for rare\". Needless to say I got well done! Horrible burger plus they use canned mushrooms yuk!\n", "rating": -1, "title": "Mobile review", "author": "Susan", "source": "urbanspoon", "time": "1389480357", "id": "270585"}, {"body": "\nIt's really difficult to rate a place when they seat everyone ahead of our party. We wait over an hour and a half with still no food. Horrible service. So be careful if you go here to eat. Great food and good beer selections don't make up for a horrible long wait.\n", "rating": -1, "title": "Mobile review", "author": "serhaex", "source": "urbanspoon", "time": "1406246514", "id": "270585"}, {"body": "\nGiant delicious sandwiches and great beer. The hardest part is trying to pick one sandwich off of the gicantic menu!\n", "rating": -1, "title": "Mobile review", "author": "Nicole Ruber", "source": "urbanspoon", "time": "1394340739", "id": "270585"}, {"body": "\nFrom the world class beer selection to the above average bar food, Fat Heads should replace Primantis as the place to go in the Burgh. Their menu is one of the largest I've seen and there's something for everyone. Upstairs is an array of beers-to-go although it's a bit pricey. Go up the hill (or mountain) to Packs and Dogs for that. Overall, Fat Heads is a wonderful dining experience and has a great beer selection to compliment. Highly recommended.\n", "rating": -1, "title": "Mobile review", "author": "Ryan", "source": "urbanspoon", "time": "1389076697", "id": "270585"}, {"body": "\nI've made this my place to go when in Pittsburgh. Their selection of beers is outstanding and the buffalo-style ribs are incredible! Just be warned that it gets busy. I came on a Wednesday night and it was packed!\n", "rating": -1, "title": "So good", "author": "apkehler", "source": "urbanspoon", "time": "1423095137", "id": "270585"}, {"body": "\nIf the line is out the door, you know, from the get go, it's going to be a wait....which is fine by us, this is our spot Monday nights for wings!Our servers have been Missy, Joe, Jenny, and Apple.... can not rave enough about the service they have always given us....outstanding servers and always go above and beyond for us when we go in there!The food....NOT diet friendly....but ooooooh so good! SO DAMN GOOD!Beer selection, and the Head Hunter IPA..... just stop, it's crazy good and this is where beer heaven on earth truly is....We wish on Mondays, when we always over order, we could take the wings home, but the policy has been this way since they opened, and we're cool with that...it's sad to say goodbye to them on the plate as we leave, but they'll find a good home we hope!Just traveled to their other location in Cleveland, and it's just as good....even though it's in Cleveland, we do forgive them....but remember Cleveland, we had them first!All and all, this is one of our favorite places!\n", "rating": -1, "title": "The line to get in....", "author": "vidadivanelson", "source": "urbanspoon", "time": "1409095204", "id": "270585"}, {"body": "\nThis is what a craft beer Resturant should be. Want a great place with a knowledge staff.....go here. Want good food that goes great with the draft selection.....this is the place. The first place in Pittsburgh to focus on craft beer is still doing it the right way. The leader is still out in front.\n", "rating": -1, "title": "Yes.", "author": "Beeroverfood", "source": "urbanspoon", "time": "1388176942", "id": "270585"}, {"body": "\nErnies Stuffed Hot Peppers\n-\nThe absolute best appetizer I have ever eaten. Perfect combination of spicy sausages and peppers topped with cheese. Can't wait to go back!\n", "rating": -1, "title": "Mobile review", "author": "Nekahi Walker", "source": "urbanspoon", "time": "1401109159", "id": "270585"}, {"body": "\nTerrible service!!! I ordered a shot and he \"joe\" didn't know how to make a shot!!! Then he became a jerk- stay away!!!! Run!!!\n", "rating": -1, "title": "Poor service", "author": "Terri", "source": "urbanspoon", "time": "1404772589", "id": "270585"}, {"body": "\nIn two words ...... Dick Head's.\n", "rating": -1, "title": "Mobile review", "author": "Susan Miller", "source": "urbanspoon", "time": "1403396039", "id": "270585"}, {"body": "\nNEVER AGAIN. We went to Fat Head's this past Saturday, at about 4 o'clock, thinking it wouldn't be too busy yet. We waited for a table for 45-50 minutes, since we really wanted to eat here. We were seated in the back/side patio of the restaurant. IT IS JANUARY. The patio had a roof but no heaters, just some plastic between the tables and the rain and cold outside. It was freezing. Since we'd waited, we decided to just stay. We got the \"fried\" pierogi appetizer, which was horrible. They were baked, bland, frozen, Mrs T's-esque pierogies with no flavor, onions, butter, seasoning, anything. We ordered a steak salad (which is why we came, we've had them before) and a portobello sandwich. The steak salad came missing 1/2 of the stuff that's supposed to be on it, with burned-up, bad quality Steakums-like meat on it, on a bed of wilted iceberg lettuce. The sandwich wasn't bad, but was cold and swimming in sauce. I sent the salad back and said overall we were very unhappy with the food (which I have NEVER done in my life.) I added that the freezing experience was miserable and that I just wanted to leave. The waitress took the salad off of our bill but we paid for everything else and left. It seemed like there were no managers on duty, and no one to check on the quality of anything coming out of the kitchen. But honestly, I think the owner is maybe just a cheapskate. The tabletops inside are covered with ads, literally. Super tacky. This place is over-priced and horrible. I will CERTAINLY never return and will urge friends to do the same.\n", "rating": -1, "title": "Mobile review", "author": "love lindsay", "source": "urbanspoon", "time": "1389634011", "id": "270585"}, {"body": "\nFat Heads has it all !A great selection of beers- probably one of the best in pittsburghthe sandwiches are so good all while being so bad for ya-- basically a heart attack wedged between 2 thick slices of Breadworks bread but u have to go and indulge every now & then and this is one of those spots :)\n", "rating": -1, "title": "when in the Burg this is a must stop for endless beers and sandwiches", "author": "HungryMan", "source": "urbanspoon", "time": "1296168145", "id": "270585"}, {"body": "\nSo many reviews of this neighborhood bar & grill. Hard to say much more. Has a large menu. With many interesting choices. You have to see it to believe it.Yes the sandwiches or \"headwiches\" are enormous. Had the \"Beefed Up\" which has corned beef and beef brisket with hot banana peppers and topped with melted Swiss, lettuce, tomato, onion, dark mustard & Italian dressing. Yes it took more than one napkin. Very tasty and tender meat. Nice combo of flavors. The bread was freshly baked and good. The \"Headwich\" comes with some great homemade thick chips (just add a little salt) that are crunchy and good. Was told the wings were good but had way to much to eat to try. If you finish you \"Headwich\" your were very hungry!The beer selection is very large and has some interesting selections.\n", "rating": -1, "title": "Top Notch Sandwiches & Beer", "author": "Effort", "source": "urbanspoon", "time": "1368729548", "id": "270585"}, {"body": "\nI like big food, and this is crazy big, casual, really good food. One of the few places I've ever not finished all the food I ordered. South Side Slopes is a killer sandwich. Wings are great. Fried mushroom app is great. Awesome beer selection.\n", "rating": -1, "title": "Makes Primanti Bros look like health food", "author": "Steve", "source": "urbanspoon", "time": "1361472601", "id": "270585"}, {"body": "\nI've been to Fatheads about a zillion times, I'll figure I'll write a review....The Lowdown:PROSHuge SandwichesSelections a Plenty (every conceivable sandwich combo)Good Wing ChoicesSurprisingly good and large saladsHomemade tater chipsLarge draught beer selectionModerately pricedFood is reliably good.CONSIt can get LOUDThe Line can get LONGYou will be elbow to elbow when it's busy.Only sometimes service can be slow,All in all it's a reliable choice for a good sandwich, and it rarely disappoints.\n", "rating": -1, "title": "Reliably Good for when All Else Fails", "author": "Ken Petri", "source": "urbanspoon", "time": "1311993334", "id": "270585"}, {"body": "\nSo this place has some of the best sandwiches EVER. The beer selection is great and you will have food to last you for at least 2 days (portion sizes are out of control.) Very loud and crowded so don't plan to just roll up and grab a seat without a serious wait on the weekends. Not the kind of place you go to for quiet dinner conversation. Overall, worth the wait if you wanna pig out on some seriously creative bar food and watch a game with some friends. One of their most famous 'headwiches' is called the South Side Slopes and it is truly delicious - kielbasa topped with fried pierogies, American cheese, grilled onions, and horsey sauce. Check it out if you like good food (and a lot of it.)\n", "rating": -1, "title": "So much food - Delicious", "author": "dinnerbelle", "source": "urbanspoon", "time": "1289333883", "id": "270585"}, {"body": "\nAlthough I have heard Fat Head's is known for their beer selection do not overlook their incredible compilation and concoction duly names the headwich! The headwich is a great creation of a sandwich the size of a persons head! Not literally but it is! The signature headwich is the nationally recognized southside slopes (pierogies and kielbasa in a sandwich and make sure to ask for their signature ranch dressing). It is worth fighting for!\n", "rating": -1, "title": "Headwiches just as good as beer", "author": "ASRoma58", "source": "urbanspoon", "time": "1296833202", "id": "270585"}, {"body": "\nA place as successful as Fat Head's has to be tempted to just take it easy, rest on their laurels, and just continue pleasing their existing fanbase. But part of what makes them great is they seem to always be adding something new. (while rarely ever deleting an item...which explains their encyclopedic menu). This time, my guest and I tried their flatbread/wraps. I guess I could have missed them at recent visits, but they were new to me. I had the Hoff-witch, and it was SUBLIME. My guest had the South Side Flats, a vegetarian wrap on par flavor-wise with any of their meaty offerings (and way better, IMHO, than the South Side Slopes, the over-rated Kielbasa-pierogi Headwich). All in all, another homerun for Pittsburgh's best pig-out place.\n", "rating": -1, "title": "LOVE the new additions..", "author": "SammyPittsburgh", "source": "urbanspoon", "time": "1313561069", "id": "270585"}, {"body": "\nGreat HUGE sandwiches and an awesome beer selection. I wish the Southside was more like Fathead's and less like Diesel but it's great that you can find some relatively unpretentious places in the Southside. Some day I'd like to sample all of their beers and get my name on their wall!\n", "rating": -1, "title": "Great", "author": "BingePittsburgh", "source": "urbanspoon", "time": "1264444065", "id": "270585"}, {"body": "\nLots of locals, huge portions. Can get crowded at times, so avoid that for best experience.\n", "rating": -1, "title": "Great", "author": "GeoLynch", "source": "urbanspoon", "time": "1361814134", "id": "270585"}], [{"body": "\nI enjoy the create-your-own aspect of this restaurant, plus the \"BOD\" burger-of the-day option. Become a frequent flyer and you can try a wide variety of burger options. I've never had anything but a burger and the shakes (which are heavenly). Good prices for sure. You won't be sorry.\n", "rating": -1, "title": "Best burger I've ever had..", "author": "Theresa Cook", "source": "urbanspoon", "time": "1430015249", "id": "1570764"}, {"body": "\nYou really need to read a review for Burgatory? Just go! The options can't be beat. The extras like shakes, chips and quinoa salad are just bonuses on top of the burgers. If you are a clean water there are plenty of choices - just get a burger bunless and get lettuce, and you get an instant hearty salad. I have been with friends and family multiple times and truthfully, have never been disappointed. The chicken burger is excellent, the steakhouse sauce is excellent, and there are lots of options for toppings. If you are going I would recommend branching out a trying something you haven't had before like the bacon jam or one of the spice rubs.\n", "rating": -1, "title": "Mobile review", "author": "Dan", "source": "urbanspoon", "time": "1426473582", "id": "1570764"}, {"body": "\nIf you haven't been to Burgatory and you love a great hamburger, you have to go. They have several options on the menu, but I always create my own from the custom menu option. Their milkshakes are fabulous and you can go healthier by substituting a delicious side salad for the homemade chips. In my opinion, it's the best hamburger in Pittsburgh.\n", "rating": -1, "title": "Favorite Burgers by Far", "author": "rsoxman", "source": "urbanspoon", "time": "1393153229", "id": "1570764"}, {"body": "\nThe seats were uncomfortable, and 6 people crowded around a small booth table. The hamburgers were brunt and had little to no seasoning, two people ordered racnch dressing on their burgers and asked for more and were up charged 75 cents each, my daughter got bbq sauce on her chicken, only had a dab on the bun and could not taste it. Used the ranch dressing in fear of another up charge. Ordered the beans and thought these were in addition to the chips, but when they brought the meal no chips. It stated no where on the menu that the beans were a substitution item and clearly stated that chips are always free. The restroom was small at best not sure why they made the restroom smaller but the Italian resturant there befor them had a bigger restroom. I was at the Burgertory at the point in Robinson twp and will not be back!!!\n", "rating": -1, "title": "Average at best", "author": "jsmith5675", "source": "urbanspoon", "time": "1417342750", "id": "1570764"}, {"body": "\nMy order was incorrect. The waitress was rude. My beer was warm. I'll never go back.\n", "rating": -1, "title": "Not a Fan", "author": "spbrad06", "source": "urbanspoon", "time": "1416503234", "id": "1570764"}, {"body": "\nBoth time that I have visited, the buns were so greasy that we could not hold them together. If you are going to specifically cook and be an expert in burgers, you might want to create a good burger. I have had the bison and elk before. I enjoy going to places where I can not cook or prepare the food as good as I can at home. I was highly disappointed in the food and no one at the table finished their meal.\n", "rating": -1, "title": "Overpriced grease", "author": "chris-flory78", "source": "urbanspoon", "time": "1420506384", "id": "1570764"}, {"body": "\nLove this place. They have the best burgers, fries and milkshakes. Have been 3 times and loved it every time. It is always packed though, so plan ahead.\n", "rating": -1, "title": "BEST BURGER", "author": "Tara", "source": "urbanspoon", "time": "1392738279", "id": "1570764"}, {"body": "\nThe food here is great. The Farmhouse salad and veggie burger are a couple of my favorites. In addition to delicious food, Burgatory staff have always been overly accommodating with my son's nut allergies. We can't say enough good things about this place!\n", "rating": -1, "title": "Great place!", "author": "danaberger4", "source": "urbanspoon", "time": "1396546026", "id": "1570764"}, {"body": "\nTwo out of three visits resulted in nearly raw burgers when the \"pink\" option was selected. If a burger joint cant cook the burgers right what hope is there for the rest? Geez..................\n", "rating": -1, "title": "It's a Burger Place---Cook the Burgers as Ordered", "author": "Sandy", "source": "urbanspoon", "time": "1419283359", "id": "1570764"}, {"body": "\nI've been a couple times to Burgatory now, and I have to say that it's definitely one of the best places to go in Pittsburgh if you're a vegetarian. This might surprise you, since it's a burger place after all, but Burgatory has the best veggie burger I've ever had, anywhere. The texture and taste are wonderful.I would recommend getting the gorgonzola fries and a milkshake (the s'mores in particular) to go along with the burger.So good.\n", "rating": -1, "title": "Best Veggie Burger Ever?", "author": "Jeff", "source": "urbanspoon", "time": "1390662083", "id": "1570764"}, {"body": "\nWe love this place! Clean and cozy atmosphere, great service and awesome food.\n", "rating": -1, "title": "Mobile review", "author": "Candice M.", "source": "urbanspoon", "time": "1399832343", "id": "1570764"}, {"body": "\nJust OK. I went to Burgatory (first time) last Tuesday for lunch. I got a customizable burger, which is a great idea. However, the food took 20+ minutes to get to my table, and was a bit overcooked (I wanted medium.) The \"grilled\" onions and \"grilled\" pineapple I got on my burger were canned or pickled, and not even hot, so that was a bummer. The beef itself was nothing special, and the 6-8 potato chips that came with it were a waste of calories. I will say, the Almond milkshake was amazing, but everything else was lacking. They better step it up if they want to keep charging $50 for lunch.\n", "rating": -1, "title": "Mobile review", "author": "love lindsay", "source": "urbanspoon", "time": "1399922919", "id": "1570764"}, {"body": "\nThe burgers are always great, but I paid 6.50 for soda with a splash of jameson's.\n", "rating": -1, "title": "Great Burger - Weak drink", "author": "timbarto", "source": "urbanspoon", "time": "1389311226", "id": "1570764"}, {"body": "\n$13 is too much to pay for a burger and a handful of potato chips. I didn't hate it, but I'll take Red Robin next time.\n", "rating": -1, "title": "Just ok.", "author": "Nitpixer", "source": "urbanspoon", "time": "1388453927", "id": "1570764"}, {"body": "\nThe food is ok but the wait is typically over 40 minutes even when tables are empty (staff is very slow)\n", "rating": -1, "title": "Not worth the wait time", "author": "Anthony", "source": "urbanspoon", "time": "1404412120", "id": "1570764"}, {"body": "\nStopped for dinner yesterday, and had a build-your-own burger and fries. I thought the burger and fries were just O.K., but the service was very good. Quick refills on drinks without even asking. I've had better gourmet burgers elsewhere, not saying this one was bad, just not my favorite.\n", "rating": -1, "title": "Good service, food O.K. . . .", "author": "Troy", "source": "urbanspoon", "time": "1404061402", "id": "1570764"}, {"body": "\nMost people order burgers, build you own or one of the specialties. Well, for some reason the crab looked good to me. So I had a delicious Crab Shack that came with a sauce and tart slaw. It was very good.Went early and beat the crowd. We were sitted immediately and had good service.\n", "rating": -1, "title": "Beef or not to Beef", "author": "Effort", "source": "urbanspoon", "time": "1316433606", "id": "1570764"}, {"body": "\nIt's Here! I like Burgatory better than BRGR and believe it or not, better than Tessaro's. And forget about Pittsburgh Burger Company!The Lowdown:It's casual, it's good for families, it's loud, it's open and airy, and it's tucked into a corner of waterworks mall. I think it used to be a Chinese restaurant.The food is burgers.. you can order a few choices off the menu or you can build your own...from bun to beef to cheese to toppings, etc...you order a \"build your own\" via a checklist ala Bahama Mama (a restaurant in the Bank Center downtown - who remembers THAT??) I opted for the hormone free beef (vs. the more expensive wagyu beef), angel dust rub (salt pepper garlic), cracked peppercorn rub, cheddar horseradish cheese and some type of aioli sauce. SHAZAM! You can also choose RED, PINK or Medium for cooking style. I choose RED of course! My kid Meg ordered hers pink. Girl after my own heart. The burger was awesome. The beef was high quality, the rubs were perfect, and the whole thing was a great, fresh, juicy, scrumptious mess! The bugers came with chips - both tater and sweet tater. They were good - no better or no worse than others. The fries were good... salted and herbed. Shoestrings...run of the mill. As far as I'm concerned 5 Guys has the best fries around - these don't even come close. The onion rings were good, and huge and almost as $$ as the burger. I don't get that, but they were good.For dessert Meg and I had one of their shakes. Whatever. It was good. Mine was Salted Nutella and hers was S'mores.. Let's be honest..I don't believe there is any way to really elevate a shake by using chocolate and vanilla ice cream. Mine had nutella - so what. Hers had chunks of ground up graham crackers. They were as good as any Dairy Queen Blizzard. They were 5 bucks for a large. Keep in mind Blizzards are 5 bucks too - so they are not all they expensive. They were good...to die for?? Na.I should mention, in addition to burgers, they also have a chix sandwich, a lump crab sandwich (which is hard to believe since it's only $10) - Backfin crab meat is probable...but lump?? They also had a few appetizers ($9 for wings???). And they have a kids menu.I would absolutely go back!\n", "rating": -1, "title": "Where's the BEEF?", "author": "Ken Petri", "source": "urbanspoon", "time": "1337966148", "id": "1570764"}, {"body": "\nSurprisingly hip, especially since it's part of a strip mall, you usually find places this trendy in tucked away, older neighborhoods of Pittsburgh, It's a little pricy for burgers and shakes, but you're compensated by the atmosphere. I have a feeling that people either love it and are regulars or tend to visit once and find it a little overrated. I have no complaints with my burger, except that they forgot to put something that I ordered on my burger (you can custom-order a burger by filling out a paper sort of scorecard in the center of your table) and I was too timid to mention it to my waiter. I would return here, it's also conveniently located by the cinema, with a little walkway that cuts through the strip mall, so if carefully scheduled, dinner here and then a movie would be a good night out.\n", "rating": -1, "title": "Hip and Tasty", "author": "Marcus Carcus", "source": "urbanspoon", "time": "1327268493", "id": "1570764"}, {"body": "\nI went to Burgatory, then went straight to Heaven. To begin with, great atmosphere- loud, a bit tight in terms of space, but HOPPIN. Boyfriend and I waited for about 45 minutes, which was not a huge deal since A.) I wasn't famished and B.) we went to the Barnes & Noble next door (fun times). They used an iPad that texted us when our table was ready, which was v cool. Now, the FOOD....bf got the steak burger (forget the name of it- it was the one with the peppercorn steak), and he said it was prettty much the best burger he'd ever had. I made my own creation- beef on brioche + jalapenos, shallot truffle aioli, and lettuce. Uh, YUM.Our burgers were gone in about 5 minutes. Chips were dec. We also got the Apple Pancake Bacon Shake- I only have one word for it: INTENSE.SO: make sure you go when you're not starving (yet)- the burgers are derish.\n", "rating": -1, "title": "Dericioush.", "author": "CL", "source": "urbanspoon", "time": "1327183038", "id": "1570764"}], [{"body": "\nWorst 35 bucks I ever spent. 25 cent Ramen noodle packs have more flavor. What a huge disappointment! What's the fuss??? People race over this . Chicken on the bone in the soup? Chewy fatty beef in the beef soup? Great pot stickers? How can hand crafted food be add o bad an have little to no flavor?\n", "rating": -1, "title": "bland, tasteless. ...", "author": "MikeB", "source": "urbanspoon", "time": "1430089903", "id": "1725651"}, {"body": "\nPork buns are great, noodles are awesome. The soup dumplings are legit. It's fun to watch the chefs making noodles through the big glass windows in the dining room.EDIT TO ADD: Been back several times and this place is consistently good. Guest chefs are brought in periodically from Taiwan to share new techniques, so even if you've been here once you should come back to try the update versions of many items. The current pork buns are good, but are in a very different style than last summer, for example.\n", "rating": -1, "title": "Best Porkbuns in Pittsburgh", "author": "Shane", "source": "urbanspoon", "time": "1407337536", "id": "1725651"}, {"body": "\nFor all you serious noodle lover out there, look no further!  This place has by far the most amazing tasting hand pulled noodles in Pittsburgh.The service was excellent, very prompt, the food came out timely.\n", "rating": -1, "title": "The service was excellent", "author": "nanamoca233", "source": "urbanspoon", "time": "1386948820", "id": "1725651"}, {"body": "\nAwesome food! I recommend the potstickers. They were the best I have ever had.\n", "rating": -1, "title": "Mobile review", "author": "KyleW", "source": "urbanspoon", "time": "1402422915", "id": "1725651"}, {"body": "\nTasty, cheap, filling. Attractive setting, friendly service. $65 for four people, with leftovers. Will be back.\n", "rating": -1, "title": "Tasty, cheap, filling", "author": "Rod Rillette", "source": "urbanspoon", "time": "1396902115", "id": "1725651"}, {"body": "\nI love this place. Everything I have eaten has been absolutely wonderful. Love the pot stickers, the soup dumplings, and shrimp, wonton noodle bowl to name a few. Great atmosphere, and exceptional service on top of the awesome food. Wish we had this place in my town. My trips to Squirrel Hill are not complete without a stop at Everyday Noodles.\n", "rating": -1, "title": "AWESOME", "author": "LuLu", "source": "urbanspoon", "time": "1415324441", "id": "1725651"}, {"body": "\nWe had the sim dum (steamed dumplings). They were really good. The atmosphere was nice. Enjoyed watching the guys make noodles. I would go back and try one of the soups.\n", "rating": -1, "title": "Great Atmosphere", "author": "Tara", "source": "urbanspoon", "time": "1392738210", "id": "1725651"}, {"body": "\nI was thrilled to have their xialongbao (soup dumplings). I entered with some skepticism as I was a faithful Joe's Shanghai xialongbao addict during my NYCer years. While nothing compares to what Joe's Shanghai in Chinatown and Flushing serves, this is a more than capable substitute at a reason quantity and price (yes, I'm looking at you, Jimmy Wan's). The pork blend was good - nice spice combo, could have used some more scallions in the blend but that's a personal preference. I also would have preferred it be served with a ponzu sauce instead of plain soy just to have the citrus brighten the pork flavor. Over all, I recommend that everyone who enjoys dumplings try these at least once. We also ordered the Taiwanese Pork Belly Slider, (Delicious. My boyfriend devoured it with delight), the scallion pancake, and the rolled onion pancakes with sliced beef. All were excellent. I would recommend this place to anyone. They serve good Chinese food that is not your run of the mill American Chinese serving General Tso's and Moo Goo Gai Pan. I can see how most Yinzers would be turned off by the selection but this foodie appreciates what the Chens have brought to the area.\n", "rating": -1, "title": "Mobile review", "author": "MoodyFoodie", "source": "urbanspoon", "time": "1394384544", "id": "1725651"}, {"body": "\nEveryday Noodles has fabulous hand-pulled noodles, delicious noodle soups and dry noodles...and, most notably, the yummiest soup dumplings!Whenever I go to Everyday Noodles, I see patrons enjoying a wide variety of really delicious-looking soups with noodles, beautiful short ribs, cold sesame noodles....most of these things I will probably never try because once the soup dumplings, always the soup dumplings.Great comfort food, especially on a cold wintery Sunday. This little Squirrel Hill eatery is cozy & warm. There's usually a wait for a table, but the place moves quickly thanks to expedient and inobtrusive service. Really cool to get to watch the kitchen pull the noodles and make the dumplings.\n", "rating": -1, "title": "If only I could actually try the REST of the menu", "author": "Bean She", "source": "urbanspoon", "time": "1393176012", "id": "1725651"}, {"body": "\nWhat can i say everything my fiancee and i ordered was awesome. The jellyfish salad was superb. Kind of a funky texture, but it was a very well put together dish. Without the accompanying vegetables it would be very bland, but still very good. Try it with their chili oil. The soup dumplings were awesome. Watch out though when you eat them because they do contain actual soup. The oxtail consommé noodle soup was delightful with the wide noodles. The noodles were beyond words. At first glance you'd think this soup was going to be really heavy and greasy, but the noodles and broth were so light and so flavorful. The bone- in added so much flavor and made for consuming the larger chunks of oxtail easy. Their sweet egg yolk cakes were amazing. Think holiday pie from mcdonalds. Very yummy and not what you would expect when you cut into one and find a very well done egg yolk sitting in the middle.\n", "rating": -1, "title": "definitely the best Asian restaurant in Pittsburgh", "author": "shawnathon1987", "source": "urbanspoon", "time": "1402628089", "id": "1725651"}, {"body": "\nSimply delicious. The dumplings were extraordinary all of them. The vegetable ones blew my mind and seemed savory and rich. Also get the grief tofu but be careful they are piping hot. Will go back very soon.\n", "rating": -1, "title": "Mobile review", "author": "TasteofLife412", "source": "urbanspoon", "time": "1400383470", "id": "1725651"}, {"body": "\nI would go back here again in a heart beat! The main thing to remember is that if you are going to eat here...you are here for the house made noodles! Watching the noodles being made was an amazing presentation of how beautiful food can be and the Dan Dan noodles I ordered were out of this world. The sauce was a bit rich for my taste, but I hope to go back some day and eat more of those noodles in a different dish! The dumplings (potstickers) were delicious and I would definitely get them again. The pork belly slider was not my favorite but it may be that I am not a fan of pork belly in such large slices (too fatty for my taste). The evening ended with bubble tea which brought back fond memories of my time living in China. I haven't had noodles this good since I lived in China and had hand shaved noodles on the street.\n", "rating": -1, "title": "Amazing Noodles!", "author": "kungfoodie", "source": "urbanspoon", "time": "1420991487", "id": "1725651"}, {"body": "\nMy husband and I took out of state friends here for the first time last month and were we ever so happy that we did! We got there shortly after it opened on a Saturday and were fortunate enough to get a seat at the table directly in front of the noodle making man. It was so interesting to watch him stretch the dough and smack it on the table to turn it into delicious noodles. Also, the owner stood next to us most of the time and explained all of the dishes and how the noodles are made. He was very informative and personable and made you want to promote his restaurant and support his venture. We all got different versions of the soup and different noodle thicknesses and no one was disappointed in their choice. Just delicious! Between the owner, the great food, and the entertaining \"noodle making man\" we will definitely return and take any future guests there also. Don't miss out on this gem in the Burgh!\n", "rating": -1, "title": "Total Entertainment and Excellent Food", "author": "PittPatFoodie", "source": "urbanspoon", "time": "1416072002", "id": "1725651"}, {"body": "\nThe pork soup dumplings are amazing!\n", "rating": -1, "title": "Great", "author": "frost920", "source": "urbanspoon", "time": "1395600307", "id": "1725651"}, {"body": "\nThe Pittsburgh area diners are likely familiar with Mike's China Palace restaurants, Monroeville and formerly Shadyside, but the new Everyday Noodles is destined for even higher ratings. The new Squirrel Hill dining option opens your eyes to the world of authentic Taiwanese fare. The trendy ambiance and the a la carte ordering afford the opportunity to savor the best of Asian fare. The glass windows separating the kitchen from the dining area allow you to appreciate the care that the chefs take in preparing each dish. I loved it and see myself returning over and over to try something new. Go early or you will be waiting in line!\n", "rating": -1, "title": "Mike Chen does it again!", "author": "melindafish", "source": "urbanspoon", "time": "1394498146", "id": "1725651"}, {"body": "\nMy favorite noodle place by far! Absolutely delicious. Great service. Clean and comfortable. I give this place 2 thumbs up, 1,000 points and 10 high fives.\n", "rating": -1, "title": "The best.", "author": "amandakust", "source": "urbanspoon", "time": "1424217461", "id": "1725651"}, {"body": "\nMy first time ever eating soup dumplings and wow were they good!!!!! Doughy deliciousness. The pot stickers were also fantastic with a nice crispy crust. The dan dan noodles were not my favorite but I think it's because I'm not used to such a thin sauce! Overall my trip to everyday noodles was awesome. Highly recommend!!\n", "rating": -1, "title": "Mobile review", "author": "Heather K", "source": "urbanspoon", "time": "1388240605", "id": "1725651"}, {"body": "\nPittsburgh has a lot of restaurants that don't necessarily serve vegetarian food, but are accommodating to some substitutions. We went to Everyday Noodles today and asked them what was vegetarian there, the hostess simply replied - \"Nothing\". So, we asked again if they could make any of the noodle dishes with vegetables/tofu instead of the meat, again, flat-out - \"No we cannot\". They were rude and didn't even try to listen to our questions, let alone be courteous. After this response, even our meat-eating friends decided not to eat here.\n", "rating": -1, "title": "Not for Vegetarians...And they were rude!!!", "author": "Hg fl", "source": "urbanspoon", "time": "1395708261", "id": "1725651"}, {"body": "\nI ate here for a business lunch, and we all ordered a variety of different dishes. The owner and the server were both really helpful in showing us how best to mix sauces and eat the soup dumplings - which are absolutely amazing, and totally fun to try and eat. Everything was delicious. I definitely recommend this place!\n", "rating": -1, "title": "Fun and Delicious", "author": "Amanda", "source": "urbanspoon", "time": "1389975646", "id": "1725651"}, {"body": "\nSo, a buddy and I met for dinner @ Everyday Noodles. There is a little bit of deception here, in the naming of this fantastic place. While they do handmake noodles, and the noodles are fantastic, there is something far greater on the menu that will make your dreams come true.Soup Dumplings. I had once seen this on an episode of Anthony Bourdain's No Reservations, when he was in China. Imagine a steamed dumpling. Enclosed within a thin, fragile steamed dumpling, if you can fathom this, is broth, meat, and vegetables. You hold one in your cute spoon. You think, \"is this going to burn my mouth?\" They tell you to poke a hole to let out the steam, or nibble a hole into the side. Regardless of how you vent the initial steam, you should. Then, you drop a little dumpling sauce (mild, not very salty, soy-type sauce) into the dumpling, and stick the whole damn thing into your mouth.What happens next is one of the great things about living. Any anger or pain you had at the time dissipates. An unbelievable explosion of flavors occurs. The warm broth fills your mouth and taste buds, and then you get the tender meat, and the hint of dumpling sauce that you just added. My first thought was \"oh damn, we only ordered 8 of these.\" I have dreams of soup dumplings stacked to the ceiling. Whatever you do, order a lot of these. They will not disappoint you. While the other food items are very good as well, you will wish you had more soup dumplings in place of the other food items. Screw variety, who needs it? When you find something you love, eat it a bajillion times.I speak very much of Opportunity Cost here, because we did order 3 other items. We tried the Pork and Vegetable Potstickers, which were also very delicious. I would definitely order that one again, and have 1 potsticker between every 8 soup dumpings I consume. We also got the Sesame Cold Noodles and Hot & Spicy Wonton Noodles. Out of the two, I liked the cold noodles better. You can really taste how fresh the noodles are. In summary, order soup dumplings, and if you're ordering a small amount just to \"try them,\" don't. Order a double size, because you'll kick yourself for not having at least 16 of them to eat. I only got a chance to have 4, and it's like going to Senior Prom with the hottest girl in school, and then after one dance, someone else takes her away from you. Don't let them do that. Order a crapload of soup dumplings.\n", "rating": -1, "title": "Order 5,000 Soup Dumplings", "author": "SweetBabyJay", "source": "urbanspoon", "time": "1371828549", "id": "1725651"}], [{"body": "\nBest everything here, I try to find reasons to drive past here and grab a bite to eat and buy some to take home! Great service, delicious food, and clean little shop! Love it!\n", "rating": -1, "title": "This place is the best!", "author": "Karakova", "source": "urbanspoon", "time": "1430177125", "id": "1708586"}, {"body": "\nExcellent baba and tabouli. Had the vegetarian lunch special and there was plenty of food. Lunch specials are only $7.95, and are worth it. Very clean with excellent service! We will be back!\n", "rating": -1, "title": "Baba!", "author": "Mimi", "source": "urbanspoon", "time": "1398975878", "id": "1708586"}, {"body": "\nCan't say enough about this fabulous restaraunt! The food is so delicious and fits right in with our heart healthy diet. The owners are friendly and generous. We went here on our anniversary February 18th and have probably been back six times as well as take out two times. You must go there and savor.\n", "rating": -1, "title": "Mobile review", "author": "W00dy", "source": "urbanspoon", "time": "1394904097", "id": "1708586"}, {"body": "\nAmazing Lebanese food. Chicken kabob that is amazing, great baba gamouj and hummus! This is the real deal!\n", "rating": -1, "title": "Mobile review", "author": "Marybeth Donnelly Cadotte", "source": "urbanspoon", "time": "1395184847", "id": "1708586"}, {"body": "\nSimply wonderful!!!!The Kafta, Tabbouli, Baba Ghanouge is the best!\n", "rating": -1, "title": "Lunch Guest", "author": "mryagnich", "source": "urbanspoon", "time": "1397069998", "id": "1708586"}, {"body": "\nI can't get enough of Cedars! Don't waste your time going to Aladdins or any other chain!! Cedars is authentic Mediterranean cuisine served in a great, friendly atmosphere. The owner's are so sweet and kind they make you feel right at home and are very helpful with any questions regarding the menu. If you are hesitant about trying this place GO!! You wont regret it and will most likely find your new favorite restaurant in peters :) Thank you Cedars for the amazing food and service, never disappoints!\n", "rating": -1, "title": "AMAZING!!", "author": "mms5336", "source": "urbanspoon", "time": "1396291208", "id": "1708586"}, {"body": "\nExcellent!! We stopped here on our way home based on the Urbanspoon reviews. We had the Mazza Platter for an appetizer. It has hummus, the BEST Baba ghanouge we've ever had, tabbouli, falafil & kyar bil-laban. The portions were generous and the pita was really good as well. My husband had the kafta kabob and I had the gyro plate. My husband has worked in Israel for quite awhile & he thought the kafta kabob was quite good, moist and flavorful not dry at all. The gyro plate was good also. The food was flavorful spicy but not hot spicy. The service was very good, fast & friendly. Altogether an excellent choice for a birthday dinner! We will definitely go back.\n", "rating": -1, "title": "Mobile review", "author": "Jolinda Steiner", "source": "urbanspoon", "time": "1398117489", "id": "1708586"}, {"body": "\nDelicious! Food was great, service was great, amazing prices! Always try to support a local place and it doesn't get much better than this.\n", "rating": -1, "title": "Mobile review", "author": "Michele", "source": "urbanspoon", "time": "1411866884", "id": "1708586"}, {"body": "\nThis restaurant never disappoints my family and me. It is consistently fabulous, even if it's takeout! My husband loves the spicy chicken. I love the Babba ganoush and the fresh pita bread. Anything you eat will be awesome!!!\n", "rating": -1, "title": "Mobile review", "author": "Deb Woodford", "source": "urbanspoon", "time": "1417908519", "id": "1708586"}, {"body": "\nTucked into the back of a shopping plaza, great Mediterranean cuisine. Family run, great service, good prices. Hummus just the right texture, lamb kabobs tender and tasty. The chef came out twice to check on our food. He also came out and gave instructions on heating takeout items. If you are in McMurray, skip the chains and eat here.\n", "rating": -1, "title": "Great little restaurant", "author": "ibailin", "source": "urbanspoon", "time": "1404917751", "id": "1708586"}, {"body": "\nBest Mediterranean food in pittsburgh! Great prices! Great service. Good for takeout! Or BYOB. Even though the atmosphere is not perfect, if you want great Mediterranean food, this is the place!\n", "rating": -1, "title": "Best Mediterranean in the Burgh", "author": "Louisa Campo", "source": "urbanspoon", "time": "1396184020", "id": "1708586"}, {"body": "\nGreat food and reasonable prices! The iced tea is AWESOME and the tabuli and humus are so yummy. It's quick and delicious and great vegetarian options!\n", "rating": -1, "title": "Mobile review", "author": "Rachel Berquist", "source": "urbanspoon", "time": "1420764692", "id": "1708586"}, {"body": "\nPrices went up, portions went down.\n", "rating": -1, "title": "Mobile review", "author": "Lucy", "source": "urbanspoon", "time": "1400669262", "id": "1708586"}, {"body": "\nDecided to try this place after reading the other reviews. Not enough time in the day to list all of the good things to say about the food. The lamb and chicken kabobs.were moist, flavorful and perfectly grilled. The hummus is the best in the 'burgh. Salad dressing oily and herby and wonderful. Tabouli was really flavorful - one of the best I have ever had. My kids loved the baklava - declaring it to be sweet and not too nutty. The only drawbacks to this place is that the pita bread is not made in house and don't go here for decor. Go for the food! The owners are very friendly and helpful!\n", "rating": -1, "title": "Mobile review", "author": "Kris", "source": "urbanspoon", "time": "1363711753", "id": "1708586"}, {"body": "\nWell we gave it a try, I do not consider middle eastern food to be one of the great cuisines so I can’t rave, But! It was all pretty good except for one thing. The Pita was terrible, wafer thin and tasteless. On the other hand the Babba Ganoush was quite nice, salads just run of the mill, spicy chicken was excellent and the Gyro which came without any Pita bread (Very strange) just a pile of meat some onions and sauce but! Delicious and much better than the local gyro joints. So all in all I give it a moderate thumbs up (at least for the food) The restaurant itself though clean has an atmosphere somewhere between a high school cafeteria and prison. Just nothing to it, a few tables and some pictures of Lebanon on the wall. Service was adequate though a little strained on communication and its BYOB so that’s a big plus. I will definitely go back for take-out.\n", "rating": -1, "title": "Good honest food, Sterile atmosphere", "author": "shmelvin", "source": "urbanspoon", "time": "1362346737", "id": "1708586"}, {"body": "\nThis is an awesome Lebanese restaurant. Many vegan and vegetarian choices as well as the most delicious hummous anywhere. The grape leaves and falafel are great! Very friendly and helpful owners! So happy my husband and I found this great place.\n", "rating": -1, "title": "Wonderful!", "author": "Barb", "source": "urbanspoon", "time": "1362290109", "id": "1708586"}, {"body": "\nIf you draw a line from Atria's to K-Mart, in the K-Mart Plaza in McMurray, this place is 90 degrees from Atria's, to the right, at the end of the row of shops.This is the place for good, down home, middle eastern cooking. Portions are good sized and tasty. So far, I've had the vegetable stew, lamb chunks and kofta, chicken, spinach with garlic, baba ganoush, hummus, spinach pie and baklava. All traditional and worth eating. His hummus and baba are the best within driving distance. My wife says their baklava is the best she's had and she would know. The cook is a generous guy, giving out tastes of this and that and he welcomes feedback in getting things just right. I wish them all the best. This area could use another good restaurant like this.\n", "rating": -1, "title": "A hidden gem.", "author": "henry", "source": "urbanspoon", "time": "1350753442", "id": "1708586"}, {"body": "\nJust discovered Cedars last Friday and have already been in twice for lunch. The weekday lunch buffet is fantastic. For only $6.99, you have all you can eat cuisine, that is simply out of this world. The food is so flavorful and authentic and the owners are just the sweetest people. Offering up samples and asking for reviews, you can tell they are trying to cater to every customers wants and needs. The hummus is the best I have ever had and the rice pudding is to die for. If you want authentic Mediterranean cuisine, this is the place to go! Looking forward to ordering off of the menu next and possibly grabbing some take out!\n", "rating": -1, "title": "Fantastic Cuisine!", "author": "Marijke Keesing Lucia", "source": "urbanspoon", "time": "1353453412", "id": "1708586"}, {"body": "\nFantastic hidden gem - great food perfectly cooked, very polite staff - don't waste your time at alladins - come here\n", "rating": -1, "title": "Mobile review", "author": "Sloan20136", "source": "urbanspoon", "time": "1380579803", "id": "1708586"}, {"body": "\nWe really love this place. Their hummus and baba ghanoush is terrific, as is their grape leaves and stuffed cabbage. Can't wait to try the chicken schwarma!\n", "rating": -1, "title": "AWESOME", "author": "s_dub", "source": "urbanspoon", "time": "1373683453", "id": "1708586"}], [{"body": "\nI've seen some bad reviews but this place was top notch. Our party of 4 used the No Wait app and were seated immediately upon arrival. The staff was courteous and attentive. Our server, Vince, was excellent. Good and drinks arrived promptly and both were delicious. We ordered poutine and pepperoni fritters to share and varying types of meatballs with sauces. Pork bolognese, arribiatta and pesto were our favorites. Everything was delicious and Vince happily split our checks for the two couples even without prompting. Even the appetizers were split in half! We had a great experience and I would definitely be back.\n", "rating": -1, "title": "Mobile review", "author": "Kelly B", "source": "urbanspoon", "time": "1432384757", "id": "1786355"}, {"body": "\nThis compared to its sister restaurant (Sienna in Market Square) is in completely different categories. While the Market Square location was more conservative in design and creative in flavor - this was more flamboyant in design with disappointing flavor. The cocktails were great though¡\n", "rating": -1, "title": "Nothing Compared", "author": "equal4all412", "source": "urbanspoon", "time": "1425739197", "id": "1786355"}, {"body": "\nPretty cool atmosphere on the 3rd floor, rooftop bar.\n", "rating": -1, "title": "Mobile review", "author": "midivi", "source": "urbanspoon", "time": "1426466232", "id": "1786355"}, {"body": "\nWe went last night after the home show, while we could not get a table without waiting 1 1/2 hrs we were able to sit at the bar and order. The food was great, a little pricey but great. My husband had the spicy pork meatballs with marina and I had the turkey meatballs with Tzaiki (sorry about the spelling), we also had the Poutain appetitizer, yum. Our bartender Andrew was great, it is an extremely busy place!\n", "rating": -1, "title": "Great Times", "author": "Patricia Parsons", "source": "urbanspoon", "time": "1425853131", "id": "1786355"}, {"body": "\nThe food is good! Always try the meatball of the day. The portions are generous. The service is always terrible unless you sit at the bar. But beware sitting at the bar. We have sat there twice for dinner and both times encountered the local *ahem* ladies of \"service\" at the bar waiting for their evening client.\n", "rating": -1, "title": "Mobile review", "author": "MoodyFoodie", "source": "urbanspoon", "time": "1430890878", "id": "1786355"}, {"body": "\nHave heard different takes on Emporio. For me, most restaurants overcook their meatballs, so was not especially wishing to go to Emporio. A few of us were guided to Emporio and found it to be a good choice. The restaurant is large, a little noisy with brick walls and a nice atmosphere. There a a few choices or meatballs, sauces, and the preparation (slider, panini with 2 meatballs, Grinder with 3 meat balls and the Saucy with 4 meatballs). Pick a sauce and cheese to top and away you go. I had the Spicy Pork panini. The Pork was cooked so it was tender on the inside and brown on the outside, not overcooked or like a rock as in most of the local joints. The Pork meatball had a nice flavor, with a little spice, could it be allspice? It really could be a tad more spicy. The Arribiata sauce came on the side. Nice! The sauce was a little spicy and thick. Again, probably could be a tad more spicy, but good.There at 32 beers on tap and starters, sides and desserts, but we only had the meatballs.All in all, a nice meal and place.\n", "rating": -1, "title": "Meatballs!", "author": "Effort", "source": "urbanspoon", "time": "1413915999", "id": "1786355"}, {"body": "\nGLUTEN FREE!! It was so exciting to be able to eat here without worrying if I would get sick! The food was AMAZING. The pesto was so fresh, and the meatballs were so delicious. Definitely going back!\n", "rating": -1, "title": "Mobile review", "author": "Laura", "source": "urbanspoon", "time": "1424097711", "id": "1786355"}, {"body": "\nUpdate: what was complimentary valet parking is now $10. Fun, casual, well-designed, value-driven spot, with an emphasis on meatballs-- delicious traditional beef ones, but also spicy pork, chicken and a vegetarian version. The menu appears small but offers numerous combinations. You could easily graze across a selection of small plates culminating in a delicious, filling dinner for $20. The \"balls\" theme extends to desserts too: Pittsburgh classic Pecan Ball(s) was perfectly executed, and the ricotta doughnut balls are not to be missed. Tested the efficient server on a couple of items-- they're well-trained on the menu. Lucky downtown workers have a great new spot to enjoy.\n", "rating": -1, "title": "Yummy Balls", "author": "Rod Rillette", "source": "urbanspoon", "time": "1391269004", "id": "1786355"}, {"body": "\nI was there last evening with a group of 15. We were told initially a 1-1.5 hour wait, so we went to the rooftop Beer Garden. (They do not take reservations.) I had a whisky sour (the best I've ever had) and the cheese plate (overpriced). Others in my group ordered the pork rinds (very bland and overpriced), the sausage plate (good), the bruschetta (bread was burned BLACK), and the steak tartare (good). After waiting an hour and a half, one of my party went to the first level and inquired about our tables. She was told another 30-45 minutes. (The \"hostesses\" were some of the rudest I have ever encountered, also.) We had tickets to be somewhere, so we could not afford to wait that much longer to be seated. We left. Finally, 3 hours and 15 minutes after our arrival, we got a text saying our table was ready.My group consisted of my co-workers. This was a staff party, and we are all in the restaurant business. What should have been a night out for fun turned into a lesson in how not to treat your guests, no matter how goofy they look.\n", "rating": -1, "title": "1.5 hour wait turned into 3!", "author": "Crunch n Munch Grrl", "source": "urbanspoon", "time": "1423420134", "id": "1786355"}, {"body": "\nI've been to Emporio three times. All three times, I enjoyed my meatballs, the sauces I tried & the apps & sides as well. The poutine is fantastic. My side salad was crisp & fresh. The mac-n-cheese was great. I've had swedish meatballs, pork meatballs & I think maybe the regular beef too - all were tasty. I particularly loved the swedish meatballs (they were the meatball of the day) with mushroom gravy & gouda as a panini. DELICIOUS. They have good beer specials too, & it's a hip downtown atmosphere. There are two big garage doors that are open in the front, if you can sit there on a nice day, it's particularly enjoyable. And the prices, for downtown, are not bad at all. I think a two meatball panini is $7. One thing I will mention is that our waiter put both my food & my friend's food on my debit card. He brought us two receipts to sign, so he must have ran my card twice. When I realized this the next day, I called the restaurant & they credited my bank account for the mistake immediately. And they were apologetic. So kudos to them for having good customer service as well. I look forward to going back again very soon!\n", "rating": -1, "title": "Good food & a nice happy hour spot too!", "author": "Vivienne", "source": "urbanspoon", "time": "1406820340", "id": "1786355"}, {"body": "\nWent there with my husband this past weekend and it we both really enjoyed it! We tried several types of meatballs and four different sauces, and all were very flavorful. My favorite was the tzatziki sauce, which had a nice creaminess without being too heavy and the cucumbers in it were shaved very thinly. The menu has a great variety of small options so indecisive people like me don't have to pick only one ; )\n", "rating": -1, "title": "Nice customizable menu", "author": "maria", "source": "urbanspoon", "time": "1415760809", "id": "1786355"}, {"body": "\nI work downtown in the summer and kept talking about trying this place. Finally did in July and ended up having a great experience. It took us a while to get service and actually had to say something to the hostess, but they made up for it and then some. There was a mix-up about who was taking care of our table, but they immediately gave us a free appetizer. I'm a vegetarian, so I appreciated the veg options. The meatballs are HUGE and the poutine was good. Definitely an eclectic experience, but I would return (even though I don't have much hipster blood) :-) . Also frequented the rooftop bar during the summer. A little pricey, but for the setting... I'll pay! Wonderful atmosphere!\n", "rating": -1, "title": "Enjoyable!", "author": "shuttybug", "source": "urbanspoon", "time": "1408118443", "id": "1786355"}, {"body": "\nI cannot say enough about this menu!! The meatballs are phenomenal. The veggie meatballs with creamy parm make me want to be a vegetarian. The wait staff and bartenders are all fantastic. I'm only confused by the hostesses; I'm convinced they're told to be rude. Host staff aside, best restaurant downtown.\n", "rating": -1, "title": "Mobile review", "author": "Cara", "source": "urbanspoon", "time": "1414239523", "id": "1786355"}, {"body": "\nAtmosphere is great. Service was good. Food was good, sampled the chicken and beef meatballs and soup. Menu is small but has everything you need. Only downside was my beverage, ordered an old fashioned and it was horrible, definitely stick to beer at this place. Really excited for the second and third floors to open this summer.\n", "rating": -1, "title": "Great concept!", "author": "Ambo", "source": "urbanspoon", "time": "1391815672", "id": "1786355"}, {"body": "\nI love trying new places and so when my boyfriend suggested coming here before a Pirates game I was all for it. We walked in and were greeted by a friendly bunch. Our hostess asked us where we wanted to sit and we said near the bar and so she seated us at a high-top very close to there. The atmosphere is very modern but with a vintage feel (and so was the music). Our waiter was very friendly and explained the daily specials and the happy hour drink specials. We ordered drinks and eventually got food. AHHHHMAZING. We both had a meatball panini which was 2 meatballs on toasted bread with cheese and dipping sauce. The meatball of the day was a pepperoni meatball which was a beef and pepperoni mix and the sauce included some of the grease from that (sounds gross but worth the try). I ate it all. It was the perfect portion and the perfect taste. I seriously thought I was going to have meatball dreams. THAT good. Highly recommend this place, and I will be back for sure.\n", "rating": -1, "title": "Meatball Dreams", "author": "kellybelle209", "source": "urbanspoon", "time": "1396572225", "id": "1786355"}, {"body": "\nI have dined at Sienna Sulla Piazza several times and am a huge fan so I had been greatly looking forward to visiting Emporio (brought to you by the same people who own Sienna) for quite some time. I finally made my way there on a Tuesday night, arriving at about 8:00pm. I love the industrial design of the restaurant-the \"garage door\" opens when the weather is nice too. We were greeted immediately upon walking in and The hostess seating us gave a very good overview of the menu, filled our water glasses, and left the carafe on the table (which I always like). Service started off shaky-we were waiting for a good 10 minutes when our server came over and apologized for the wait, thanked us for being patient, and added she was having a computer issue and couldn't find anyone to help her. Having worked in food service before, I'm very understanding and wasn't bothered by this as I've had the same issue. She took our drink order and those were promptly brought to our table (I had the Boulder Mojo a nitro IPA and my boyfriend had an Old Brown Ale). They have a decent draft selection-lots of IPAs which I love. Most are between $5.50-$7 so typical Pittsburgh prices. We started off with the buffalo fried chicken balls with blue cheese and celery. The celery was shredded and blended with the blue cheese which topped the fried chicken balls. They were delicious-had a definite kick to them-and there were 6 balls so it was perfect for sharing. For our entrees we both decided to do 2 sliders (since you can't do multiple types of meatballs in any of the serving options-that was my one negative). We both did a meatball of the day slider. The meatball of the day was a ground beef/corned beef mix topped with saurkraut and stone ground mustard. WOW! It was perfectly pink in the middle-how I like it-and the flavors blended together perfectly! My boyfriend chose a spicy pork slider with Arribiatta sauce which he said was very good. I chose a chicken meatball with the tzatziki sauce and again-WOW! The tzatziki sauce was probably the best I've ever had and I really liked the flavors in the chicken meatball. After that hiccup in the beginning, service was great-we were checked on at exactly the right points during our visit, our glasses were always full, after we finished the plates were immediately cleared. She was very talkative and friendly and made a great suggestion on the Boulder mojo I had. She also told us the 2nd floor opens next week so we will be visiting that hopefully soon. We had a great experience from start to finish (minus that hiccup with waiting for our server at first) so do not hesitate to make your way down to Emporio for some delicious meatballs-we will absolutely be back for a return visit.\n", "rating": -1, "title": "delightfully delicious meatballs", "author": "laura-hoover", "source": "urbanspoon", "time": "1398868194", "id": "1786355"}, {"body": "\nA group of us dined on the second floor after seeing a show. We had a wonderful time. The décor is chic but still warm and cozy. There were quite a few of us so we were able to see a large variety of dishes. I personally had the bacon and clam pizza which was divine and my husband enjoyed the pork special of the day which was a boneless chop. He raved about it. To start our meal we ordered two of the cheese plates to share with our group - one local one Italian. Overall we had a great experience - the restaurant seems to lend itself to family style sharing which is very fun with a group of friends. Next time we go, I hope the third floor beer garden is open!\n", "rating": -1, "title": "Great atmosphere and a wonderful meal", "author": "doubleyoi82", "source": "urbanspoon", "time": "1421176799", "id": "1786355"}, {"body": "\nI had heard good things but I was pretty disappointed! Their meatballs were okay. The prices actually weren't terrible on the lowest level. The charcuterie was just not it, though. Almost $40 for a board and it was obvious they're still doing their first runs at this. The cheese selection all tasted mild and oddly was the same color. Unless someone told you, you would never know they were different varieties because they didn't vary in taste or color. The meat selection was sub-par. The sausage was awesome but the rest of the cured meats weren't salty or had any particular taste. Same deal as the cheeses. All in all, the experience was a underwhelming. The shift manager was entirely unhelpful in figuring out another option to turn our experience around, to top things off. It just wasn't that great! Go to Meat & Potatoes if you're looking for a better charcuterie.\n", "rating": -1, "title": "Mobile review", "author": "Dani Nader", "source": "urbanspoon", "time": "1413927239", "id": "1786355"}, {"body": "\nWent on opening night and absolutely loved it. Got the beef meatball with creamy Parmesan sauce and it was amazing! only $3 for one slider. our meatballs came out quickly and everyone at the table was happy. drinks were decently priced and tasty. our waitress knew a lot about the place and was so excited we came out to try. definitely will be back.. and very excited for the second and third floors to open!\n", "rating": -1, "title": "Mobile review", "author": "Jaclyn", "source": "urbanspoon", "time": "1391654287", "id": "1786355"}, {"body": "\nI love this place, I've never had a bad meal, good beer selection, and atmosphere. I always get whatever the special is because it is always delicious!\n", "rating": -1, "title": "Delicious", "author": "whoaGirl", "source": "urbanspoon", "time": "1422400686", "id": "1786355"}], [{"body": "\nAbsolutely amazing! I got the goat cheese stuffed chicken and my friend got the special of the day. The chicken was moist and cooked perfectly. We also got hummus as an app and that was great as well.\n", "rating": -1, "title": "Mobile review", "author": "Kath", "source": "urbanspoon", "time": "1426852137", "id": "271348"}, {"body": "\nMy boyfriend and I wanted to get a bite to eat and watch this past sunday's 1pm football games, so where better to head out in Pittsburgh than to the south side!Neither one of us were really \"feeling\" anything in particular and had not settled on brunch but as we were walking down carson, the rain picked up, so we ducked into the next place that we saw with tvs and food. I had actually wanted to visit Piper's Pub for awhile but always seemed to forget it was there.The bartender quickly got our drinks (black and tan-which my boyfriend said was poured perfectly) and a London's Pride Fuller Pale Ale for me. My boyfriend ordered the Lamb&smoked; chestnut sheperd's pie. He said the chestnuts were excellent-smoky and savory. You could tell it was finished being made and then immediately served because he could not even touch his plate for the first ten minutes as the food was so hot!Being on a salmon kick lately, I ordered the smoked salmon boxty. The boxty was comparable to the size of my head and was very yummy! The dill sauce complimented the smoky flavor of the salmon as well as the potato pancake holding the bundle of deliciousness together. I noticed how nearly everyone besides the two of us had a bloody mary in front of them so of course i had to try one! I asked for light on the spice, however, it is a premade blend so the bartender added extra tomato juice for me, which made it perfect!I would love to come back for one of the soccer matches-particularly Chelsea or Man U-but this was a great place to grab a quick bite and some (american) football on a sunday afternoon!\n", "rating": -1, "title": "Brunch", "author": "laura-hoover", "source": "urbanspoon", "time": "1387830024", "id": "271348"}, {"body": "\nIt seems that this place impresses a lot of people, so maybe we just hit it on a bad day. On the positive side, there is a great selection of excellent beer. But the food was underwhelming. The servings were large, but that doesn't make up for lack of quality. I had the seafood shepherd's pie. There wasn't much seafood, and it wasn't a traditional shepherd's pie, which should be somewhat like a pie, with a potato crust. Instead, I got a large plate of minced seafood (I guess) in a creamy sauce (broth? fluid?) with a layer of potato pieces scattered on top. There was little evidence of fish, culinary skill, or taste. My date had a dish of bangers (English sausage) in a Yorkshire pudding. The bangers were fine, but the onion gravy was not good. Our friend had fish and chips and said it was good. It looked good, and the serving was large. We probably should have ordered something simple like that. If I give this place a second try, I'll stick to very basic fare, or probably just have beer. Oh, one last thing, skip the Scottish eggs.\n", "rating": -1, "title": "Maybe an off day?", "author": "Paladin", "source": "urbanspoon", "time": "1399601246", "id": "271348"}, {"body": "\nSolid meal, good portions. Had a build your own burger.Nothing spectacular but I've had lots worse. Great beer selection. Waitress was really nice and got everything right.\n", "rating": -1, "title": "Good stuff", "author": "ed", "source": "urbanspoon", "time": "1409541804", "id": "271348"}, {"body": "\nOne of my most anticipated places to eat in the Burgh and it lived up to the hype. I could not have asked for a better Shepherd's pie. Also a good selection of craft beers. Highly recommended.\n", "rating": -1, "title": "Mobile review", "author": "Ryan", "source": "urbanspoon", "time": "1389077180", "id": "271348"}, {"body": "\nGreat food and service. I am new to town and was searching for a great place to watch soccer games. A plus here. Everything I have tried is fantastic.\n", "rating": -1, "title": "Mobile review", "author": "danny b", "source": "urbanspoon", "time": "1394728230", "id": "271348"}, {"body": "\nHow did we not know about this place?! A great selection of brew is just an added bonus to the Irish influenced cuisine offered at Piper's Pub. Located in the heart of the Southside, this is a hidden gem in the mist of many eateries in the area. What we ordered: Seafood cakes - very good and freshly made. They were very filling and were complimented with a small side salad. The smoked chicken wings got no complaints and were devoured by our son who claims to be the wing connoisseur. The goat cheese stuffed poppers were very tasty and an appy we would definitely order again. I only wish they would have had more sauce with them because it added a wonderful flavor. So do yourself a favor and ask for extra sauce. But the star of the night was the fresh fried fish. I have to say it was one of the best fish sammies we have had in the Burg! We can't wait to go back and try some other dishes, but the fish is a must do for us again!\n", "rating": -1, "title": "Yum!", "author": "mickeymotto77", "source": "urbanspoon", "time": "1421526182", "id": "271348"}, {"body": "\nPiper's Pub never disappoints. The food is always great and so is the beer selection! The wait staff is always very friendly and helpful. A great place to go.\n", "rating": -1, "title": "Great food and atmosphere", "author": "foodie22", "source": "urbanspoon", "time": "1410704925", "id": "271348"}, {"body": "\nI had a hankering tonight for some fish and decided to go to Piper's Pub. I have been to Piper's Pub many times and found the food to be awesome, the portions were large and the pricing was very fair. I was so disappointed tonight! I found that the prices were raised which I did not mind but upon ordering and receiving my fish I was served three very small squares of fish and some pieces of what was supposed to be french fries. Boy! This is not what I am used to. I would like to give some advice to the owners of Piper's Pub who are great people. Don't reduce the level and quality of your food after raising your prices, I am going to think long and hard about going back due to not wanting to be highly disappointed again. So please look at this as constuctive criticism and buyers beware.\n", "rating": -1, "title": "Honestly Disappointed", "author": "bullitt67", "source": "urbanspoon", "time": "1422320348", "id": "271348"}, {"body": "\nstopped in last night. is there some sort of law in Pittsburgh you cant have more than one bartender behind the bar on a Saturday? no wonder there were dirty plates half way down the bar! it never ceases to amaze how CHEAP people in this city are......\n", "rating": -1, "title": "BLIMEY!", "author": "tuco", "source": "urbanspoon", "time": "1423415885", "id": "271348"}, {"body": "\nThe team at Pipers never fails to be warm, gracious and welcoming, and the kitchen pleases consistently. We can descend upon them in the middle of the afternoon with hoards of children and are always assured of excellent service, great brews and phenomenal food. This southside gem remains a steadfast go-to when we can get away for an afternoon.\n", "rating": -1, "title": "Gracious staff, excellent kitchen", "author": "marcus eubanks", "source": "urbanspoon", "time": "1311305935", "id": "271348"}, {"body": "\nPiper's is a favorite of mine for brunch. Get a boxty - a crispy potato pancake folded over any sort of filling. Both the smoked salmon and grilled veggie are excellent! They are big enough to split with someone and go great with a bloody mary (with absolute pepper, of course).\n", "rating": -1, "title": "Go for brunch!", "author": "SP", "source": "urbanspoon", "time": "1357063705", "id": "271348"}, {"body": "\nrecently stopped by here after having not been for about 6 years. tried one of the boxtys (potato pancake with various things inside.) good hangover-remedy as I was hurtin' a lil from the night before . i plan to come back more frequently and try the fish & chips and other menu offerings. the whiskey list looks impressive even if i'm not much of a brown-liquor guy . (and who can afford to drive home inebriated ? ) good place to head with a designated driver in tow ... on the loud side ... perhaps the only bar left in the south side flats that ISN'T catering to bratty college kids/20-somethings. this is good .\n", "rating": -1, "title": "good hangover food", "author": "omnamahshivaya", "source": "urbanspoon", "time": "1374426873", "id": "271348"}, {"body": "\nBangers and Mash, Shepherds Pie, Strongbow Cider\n-\nI have eaten at Piper's Pub for lunch and dinner and have never been disappointed. It's the kind of place where you can order anything and you know it's going to be delicious! Even though it's a pub, the restaurant section is very cozy and welcoming, I have no problem eating there with my toddler son. They have the best gravy. Our server was nice, attentive, answered our questions and gave good suggestions. The only thing I didn't like was the ice cream sandwich. It was a frozen solid block of vanilla ice cream and shortbread which didn't taste very fresh and the garnish sauces tasted factory made. I think I'll just get the bread pudding next time because I plan on going there plenty more.\n", "rating": -1, "title": "Always a pleasure!", "author": "Alex Sadlo", "source": "urbanspoon", "time": "1363654256", "id": "271348"}, {"body": "\nI stopped into Piper's Pub a week or so ago for dinner on a Saturday night. I'm not sure why, but I went into Piper's with a preconcieved notion that this was going to be a chainy, manufactured fun style fake Irish Pub. However, my meal and our experience changed my mind. This is just a good place to get great food. The serving sizes are huge, and everything we had tasted great. The only thing I was a bit taken by was the beer prices ($4 for a yunegling bottle is a bit steep.) I will definately be coming back again. P,S. My room mate swears that this is the best fish and chips in all of Pittsburgh.\n", "rating": -1, "title": "It won me over", "author": "AlexW", "source": "urbanspoon", "time": "1268667042", "id": "271348"}, {"body": "\nScotch eggs with HP brown sauce, followed by bangers n mash is my heaven.\n", "rating": -1, "title": "Mobile review", "author": "McHatter Hat", "source": "urbanspoon", "time": "1358730727", "id": "271348"}, {"body": "\nThe food is tasty, and the menu is varied (so if you're not in the mood for Irish food when you go, have no fear). There's a great beer selection with reasonable prices. The customer service is great -- we had a very friendly and fun server yesterday, and they are also very responsive via Twitter/e-mail. Though I don't venture to the South Side too often, I would be willing to go back there to visit Piper's again.I'd like to catch a football game there sometime; I imagine it would be a lot of fun.\n", "rating": -1, "title": "Enjoyable food and atmosphere", "author": "EE", "source": "urbanspoon", "time": "1297444734", "id": "271348"}, {"body": "\nThe family chose Pipers for a change of pace and I am happy they did!You walk in and it is well lit, clean, people are friendly and a decent size dining area in the back. While the wife wanted it to be appointed in dark wood to give it a rough feel, I like the way it was. If you ever been to the British Isles you will be familiar with some of the staples with their menu, if not, then this is a chance to sample it without taking the 7 hour flight! They have a good selection of beers and scotches that will make you feel like you are in a pub in the UK and not in the south side of Pittsburgh.We had the Scotch eggs and Ploughman's platter for appetizers which was outstanding, followed by the herb chicken and the Stilton stuffed chicken breasts. All I can say is WOW on the flavors and how much there was! The plates were huge and there was barely any space where there was not food. I would be surprised if anyone walks away hungry from Piper's pub. After this outstanding meal with outstanding service, I was surprised at how reasonable the bill was. For the amount of food and the quality of it, you would pay 25-30% more at a chain (and not be as satisfied). If you are in the south side and want good atmosphere, comfort food, great service and fell good when the bill comes, don't go anywhere else, stop here, you will be happy you did.\n", "rating": -1, "title": "The taste of the British isles without the cost to travel there.", "author": "dondk", "source": "urbanspoon", "time": "1282191113", "id": "271348"}, {"body": "\nPiper's Pub is the first place I like to take visitors when they are in Pittsburgh. The food is amazing and the service is great. Some highlights are the plethora of beers on tap and the fantastic onion soup. When I go there I can't not order the open faced roast beef because it is out of this world! It comes with homemade mashed potatoes which are rare and great addition. I've been to Piper's many times and I have never left disappointed. This past weekend a group of 8 of us walked right in and were seated immediately at 9 pm when Fathead's across the street had a 2 hour wait! The prices are also extremely reasonable. My boyfriend and I have had dinner, he had a soup and a beer too and the bill was only $35! I can't say enough good things about Piper's, it is definitely a bit of a hidden jewel and the best place on the Southside.\n", "rating": -1, "title": "BEST PLACE IN THE SOUTHSIDE", "author": "Twink25", "source": "urbanspoon", "time": "1375111087", "id": "271348"}, {"body": "\nI’ve never been one who cared much for UK cuisine, but after having gone to Piper’s my opinion has changed some. I can’t say I can judge the authenticity of the menu but I have been happy with everything I have had (the toad in the hole is a good and unique dish). The brunches are even better with the addition of the boxty’s (potato pancake flipped and filled like an omelet) which I wish they served all the time; they’re damned good and worth going to brunch there for. Beers are a bit pricey due to its prime location on the South Side, but the food is perfectly reasonable and with good sized portions; the times I have asked for a substitution/change the kitchen has happily complied. Every server and bartender I have had has been friendly, outgoing and attentive so no qualms there. They have a good selection of beers and although I’m not much of a liquor drinker they have plenty of whiskeys and scotches for those who are. The traditional European pub atmosphere is also quite nice with the hard wood floors, tables and bar while a good amount of lighting and a few tv’s ensure it doesn’t get too dark or dreary in there. Piper's is definitely a nice change of pace in regards to most of the bars found in PIttsburgh and this is one of the few places that can drag me to the South Side anymore.Also, be forewarned: this is one of the few places where they broadcast European soccer, in particular the English Premier league, so on Saturday and Sunday mornings expect this place to be crowded. Of course is that is your sort of thing this is your place to go.\n", "rating": -1, "title": "Nice to have something different in Pittsburgh", "author": "I'm No Foodie", "source": "urbanspoon", "time": "1375444956", "id": "271348"}], [{"body": "\nI have been here a handful of times. Every time the food has been great. The staff has been very friendly and patient, with even the pickiest person in our bunch. The pizza is very good, you can tell that they make their own fresh dough. I personally appreciate the gluten free options. I always sigh when someone suggests we go out for pizza, due to me having to eat gluten free. That usually means that I will be smelling delicious pizza while I have to eat a salad. Not Here! They have something for everyone. I can enjoy a surprisingly amazing gluten free pizza, not the typical burnt thin cardboard that I have gotten at other places. I have also had the gluten free pasta and gluten free brownies both of which where great. A lot of places now have some sort of gluten free options, I could go to a local Italian chain in the area and get gluten free pasta. However, Juliano's was much better and will the chain restaurant take the time to make me a gluten free brownie ( I think we all know the answer to that). You can tell that they want to make their customers happy and care about their reputation as a family business.\n", "rating": -1, "title": "Something for everyone! Even Gluten Free", "author": "rachelle_renee", "source": "urbanspoon", "time": "1429066707", "id": "661434"}, {"body": "\nPerfect, crust, taste.\n", "rating": -1, "title": "large pepperione piza", "author": "rochellerastelli", "source": "urbanspoon", "time": "1428670039", "id": "661434"}, {"body": "\nWe have been out on a dinner date several times at Juliano's and we have never been disappointed. The secret at Juliano's is more than the food; it is their wait staff! Good food is always made better when served by effecient and congenial servers. They make us feel welcome; they make us feel important. The atmosphere is warm and always inviting. Good food! Great employees! Keep it up, Juliano's.\n", "rating": -1, "title": "Operation: Dinner Out!", "author": "twmangan1", "source": "urbanspoon", "time": "1425342285", "id": "661434"}, {"body": "\nMy friends and I have been coming here for years and every time is like the first time. Excellent. Great place for good food, with best friends, and great service.Going on celebrating 13 years going to Juliano's!\n", "rating": -1, "title": "Best place for good and service.", "author": "mecchia", "source": "urbanspoon", "time": "1427069262", "id": "661434"}, {"body": "\nWe came in town for a hockey tournament and they went above and beyond to accommodate our team of 30. The food was absolutely amazing. The service was impeccable. They treated us like family. Thanks so much for making our last night in Pittsburgh amazing. A must if you are in the area or worth the drive if not.-Wooster Blades Mites\n", "rating": -1, "title": "Amazing food, treated us like family", "author": "erikaharwood", "source": "urbanspoon", "time": "1424056313", "id": "661434"}, {"body": "\nWe have been customers of Juliano's since it first opened 36 years ago and we keep going back! We usually eat there several times a month. The food is excellent, the staff is very friendly and the atmosphere is just right for the kind of restaurant that it is. We have celebrated special occasions here and they have also catered various family events for my family. Throughout the years, several of my family members have worked at the restaurant, starting from when it first opened until the present. The food is good quality - their pizzas are great We've taken friends there and they have now become 'regulars' also. We are lucky to have a restaurant like Juliano's in the area - going there is almost like going to visit family!\n", "rating": -1, "title": "Juliano's Restaurant is almost like family!", "author": "hildaobusek", "source": "urbanspoon", "time": "1410969971", "id": "661434"}, {"body": "\nThe food is delicious. Love the atmosphere and the service. The owners and employees actually care! A Pittsburgh tradition\n", "rating": -1, "title": "Authentic Hometown Italian Food", "author": "momifregi", "source": "urbanspoon", "time": "1424044089", "id": "661434"}, {"body": "\nI have ordered from Juliano's catering for several of my event's (ie. baptism, birthday parties-about 75 people at each) and we couldn't have been happier with how everything turned out. The food was excellent, plenty of leftover's as well. Roseanne was wonderful to work with and thankful for the ease of the pickup of food. I was able to enjoy myself at my event's and even received compliments from my very opinionated Italian family. Would definitely do this again and obviously would like to thank Juliano's establishment and would certainly recommend.\n", "rating": -1, "title": "catering was a perfect choice for my events", "author": "kjohnston330", "source": "urbanspoon", "time": "1410441703", "id": "661434"}, {"body": "\nOnce again, Juliano's did not disappoint when we had our daughter's Christening reception there in September (also had our son's there in 2010) The staff was prompt and friendly, the food was hot and delicious, and my family was fighting over leftovers...my Dad got first dibs! Going tonight for there all-you-can-eat pasta with my Aunt from New Jersey who always has dinner at Juliano's when she is in town-and am sure we will not be disappointed! Considering we are Italian and take our food very seriously, we highly recommend Juliano's for authentic Italian cuisine, whether it be for catering or just dinner with familia!\n", "rating": -1, "title": "My Italian family fights over Juliano's leftovers!!!", "author": "cmalizio", "source": "urbanspoon", "time": "1415131723", "id": "661434"}, {"body": "\nI ordered wings and soup. The 2 items I figured would be cold when they got here. The older man who delivered was very polite and nice. The food is hot, fresh and cooked to perfection. Couldn't have chose a better place. Ps: I love the wedding soup!!!!\n", "rating": -1, "title": "Perfect Delivery", "author": "jessilee41793", "source": "urbanspoon", "time": "1416936174", "id": "661434"}, {"body": "\nFinally a place around here that offers gluten free pizza! And it was really good! Thanks for adding this to your menu!\n", "rating": -1, "title": "Gluten Free!", "author": "lynettegerstel", "source": "urbanspoon", "time": "1424011858", "id": "661434"}, {"body": "\nI have visited for the last two days while at training in the area. I have been pleasantly surprised with the price of the good and the kindness of the gentleman I assume to be Nick. Clearly he takes personally how to run the business. Well appreciated! Good job!\n", "rating": -1, "title": "Mobile review", "author": "Kid", "source": "urbanspoon", "time": "1394668180", "id": "661434"}, {"body": "\nI usually like the buffet here (not a frequent visitor, but I've had it before), and today it just wasn't the best. The first pizzas that were put out were fresh and good, but the third one that was brought out was really dark, and it tasted like yesterday's leftovers reheated . . . I couldn't even eat it . . . it was horrible. The deep fried zucchini was O.K., but it was kinda dry, so I put a little red sauce on it that I took from the rigatoni pasta on the buffet. The marinara sauce wasn't brought out until the zucchini plate was already empty, and then they replaced the empty plate with deep fried mushrooms, and some of the mushrooms were still cold on the inside. It took 45 minutes before any Italian hoagies arrived on the buffet, and I was sadly disappointed because they were cold and not cooked enough on the inside, and just didn't taste good. I also should mention that there were some dirty plates on the buffet too, like somebody didn't wash them properly. Also, I was hoping for maybe some wedding soup on the buffet, but they didn't have any. And lastly, the pieces of garlic bread were too big . . . I think they should be cut into smaller pieces. I ended up getting two big pieces because they weren't cut properly and stuck together, which was about 3/4ths more bread than I wanted. I'll come back again some day, but I really hope they step it up a bit, since today was kind of an off-day. At least the cost wasn't too bad . . . $9.00 for all you can eat.\n", "rating": -1, "title": "An off day on the lunch buffet?", "author": "Troy", "source": "urbanspoon", "time": "1392751211", "id": "661434"}, {"body": "\nBest pizza! Their pizza crust is absolutely perfect...crispy enough to hold up under all the toppings, but still soft and chewy. Delicious!!! We go out of our way to enjoy Juliano's pizza and pasta.\n", "rating": -1, "title": "Best Pizza!!", "author": "ksmg", "source": "urbanspoon", "time": "1414943582", "id": "661434"}, {"body": "\nJust wanted to let everybody know that \"somebody finally got it right\"! I ordered a gluten free pizza from Juliano's after Nick told my husband that Juliano's offered them now. Well, I thought I died and went to gluten free heaven! Finally, a GF pizza that looked and tasted like real pizza, not sauce and cheese on cardboard like other restaurants serve or the frozen GF cardboard crap that is pawned off as pizza. I've even tried GF pizza crust mixes and ready-made shells. All crap! The best part about Juliano's GF pizza was that it still tasted like JULIANO'S PIZZA!!!...which in our opinion, is the best on the planet. It may sound cliche, but my life just got better thanks to their pizza. I can't wait to have it again! In spite of my gluten intolerance, I was willing to \"suffer\" and indulge in Juliano's regular pizza when my husband would bring it home. I'd be sorry within an hour of eating it, but always said \"it was worth it\"! Lol. I can't tell you how glad I am that I don'thave to suffer any longer! Thank you, thank you, thank you, Juliano's!!!\n", "rating": -1, "title": "Gluten Free Pizza from Heaven!!!!", "author": "sputzie", "source": "urbanspoon", "time": "1412794097", "id": "661434"}, {"body": "\nAward winning pizza? Not really... the crust tasted pre-made, not like fresh dough. There was barely any sauce on my pizza either. I can get better pizza anywhere else, but I'll give Juliano's another chance and come back for some pasta.\n", "rating": -1, "title": "Mobile review", "author": "Lilly01", "source": "urbanspoon", "time": "1426347620", "id": "661434"}, {"body": "\n$30 for a cold 1/2 Italian with 2 slices of lunchmeat, 1/2 steak with barely any steak, and 20 \"decent\" wings. The pizza is usually a staple, but very disappointed in our most recent order...Edit: The owner, Nick, took the time out to call and make this situation right. Thank you for responding to the review and reaching out to right the situation, I can appreciate that! We have ordered a handful of times after this and the food and service has been top-notch like we remember. Thanks for being an attentive business!\n", "rating": -1, "title": "Mobile review", "author": "Dan", "source": "urbanspoon", "time": "1402512717", "id": "661434"}, {"body": "\nThe numbers on this place are awesome (a 90%+). I guess I can understand it for some people, but not for me.The food was adequate, it came hot and quick. The cost was not offensive, the waiter was nice, it was clean (albeit a bit out dated). I have nothing to complain about, it was o.k. Obviously, people like the place. It's just not for ME. To me it's like every other Italian restaurant on every corner, in every neighborhood in Pittsburgh. Italian restaurants are to Pittsburgh what Chinese restaurants are to San Francisco, there a scads of them and they are all \"O.K.\" To me, Juliano's is not bad, it's just O.K.. Congrats to you Juliano's for finding your niche audience, I am just not one of them. I wish you continued success. I am going to continue my quest for the BEST.\n", "rating": -1, "title": "On a quest for the BEST!", "author": "Ken Petri", "source": "urbanspoon", "time": "1389033828", "id": "661434"}, {"body": "\nStopped at Juliano's for the first time, and found it to be a great experience. The food is very good, but what made it so enjoyable, was the owner taking time to talk with us about our thoughts on his restaurant. He wanted to make sure our experience was a good one, and we appreciated the hospitality. That's how it used to be! The food is very good and the prices are more than reasonable. We will be back, and please, don't change the way you do business. By the way, we are from Ohio.\n", "rating": -1, "title": "That's how it used to be!", "author": "loganjon7", "source": "urbanspoon", "time": "1407790327", "id": "661434"}, {"body": "\nBeen coming to julianos since I was a kid. Love the food and service!\n", "rating": -1, "title": "Love julianos!", "author": "cburkes16", "source": "urbanspoon", "time": "1407679661", "id": "661434"}], [{"body": "\nWe had lunch there. It was good. We had to wait a VEERRYYY long time to get it. We had a waitress that seemed to care less about us. I had ordered sweet potato fries with my sandwich. When she brought the order out I told her that. She was in denial; until she read the order and then hurried back with a sweet face and the fries. I told her when she had brought the waffle fries to just forget about it because I could see she was miffed. We then asked for the check, that took forever!! The table next to us got their food promptly. I don't know, guess she didn't like us. I don't want to give this place a bad rating, the food wasn't bad but she ruined our experience.\n", "rating": -1, "title": "Whose fault is it?", "author": "mellettcarrie", "source": "urbanspoon", "time": "1432418040", "id": "270900"}, {"body": "\nI went here for lunch and had the Kaya burger and was well beyond satisfied. The flavor development and the stacks of different accents was impressive. The only issue is the portion was huge - so it was awkward to try and pick up. Besides that - I'd strongly advise going.\n", "rating": -1, "title": "Best Burger in Pittsburgh", "author": "equal4all412", "source": "urbanspoon", "time": "1425739454", "id": "270900"}, {"body": "\nWent on a Friday for happy hour. A group of rude women were \"saving\" several bar seats with condiment stands, napkins, purses, etc. Made hostess aware of the situation, she refused to take any action. Hey, guess what? You just lost $100 worth of my business and I'll think twice about returning.\n", "rating": -1, "title": "Hostess needs to take control.", "author": "brian", "source": "urbanspoon", "time": "1425755922", "id": "270900"}, {"body": "\nLobster Tacos\n-\nSurprisingly delicious lobster served in 3 small hard shell tacos. The lobster is highlighted without being overpowered by the other ingredients.\n", "rating": -1, "title": "Lobster Tacos", "author": "Christopher Best", "source": "urbanspoon", "time": "1427244153", "id": "270900"}, {"body": "\nThursday night is Fried Chicken Night. Marinated buttermilk fried chicken that comes with a spicy slaw, watermelon salad, tortillas an line habanero mojo. How can you go wrong. Always have fun at Kaya. Good service too. The fried chicken is Oh So Good. Tasty and moist. A little tangy and the lime habanero mojo is great. The spicy slaw is OK but the watermelon salad is a waste. To much vinegar that completely overwhelms the watermelon and some cucumber.\n", "rating": -1, "title": "Fun of a Gun", "author": "Effort", "source": "urbanspoon", "time": "1409273454", "id": "270900"}, {"body": "\nI've been to Kaya at least 40 (billion) times in the past few years. Best happy hour in Pittsburgh, if you haven't already heard. Great tap selection, with some higher priced exclusive specials that rotate regularly. Also great wine and extremely tasty cocktail selection, all still included in that amazing happy hour deal. Really good food options as well, and a tasty hangover brunch +bloody mary made my 23rd birthday morning quite lovely. The monthly vegetarian dinner is what initially brought me to Kaya when I lived out in the South Hills, and the regular menu and expansive drink selection kept bringing me back through the years.\n", "rating": -1, "title": "Beers, brunch, and bloodys", "author": "Cassie Kay", "source": "urbanspoon", "time": "1390977608", "id": "270900"}, {"body": "\nHaven't been in over 15 years. Husband didn't think he would like it. Turns out we both loved it. Delicious fish tacos, maybe even better than Mad Mex. We had the conch hush puppies for an appetizer, they were perfectly crunchy and spicy sauce was good. Husband got two \"small plates\" ribs and calamari, lots of both, he was stuffed. Place was crowded, but we were seated right away. Want to go back soon!\n", "rating": -1, "title": "pleasantly surprised", "author": "dd smith", "source": "urbanspoon", "time": "1389628705", "id": "270900"}, {"body": "\nKaya has been a favorite for years! The food is always innovative and tasty. Service has always been attentive and personable! Tonight did not disappoint! Happy hour prices on wine and great food! Ordered the vegetable paella and the tofu tacos and both were amazing! Will be back no doubt!\n", "rating": -1, "title": "Mobile review", "author": "Eric D", "source": "urbanspoon", "time": "1391057345", "id": "270900"}, {"body": "\nTERRIBLE SERVICE. I was so excited to try Kaya, but could've done without the mediocre food and terrible service. Drinks and dinner for a party of 4 took nearly two hours, most of the time spent waiting for another round (we each only got two drinks because it was so slow) and waiting for our check. I honestly have nothing to say about the food, other than it's overpriced. When we finally got the check and saw Kaya is part of the Big Burrito restaurant group, I wasn't surprised at the bad service. Mad Mex is the pioneer of trendy employees who are incompetent and rude.\n", "rating": -1, "title": "Mobile review", "author": "love lindsay", "source": "urbanspoon", "time": "1389634795", "id": "270900"}, {"body": "\nI went with a group of 6 last night and it was really good. The fish tacos and bean dip lived up to the hype. Both were outstanding. I'm already looking forward to going back soon!\n", "rating": -1, "title": "Mobile review", "author": "steeler-nurse", "source": "urbanspoon", "time": "1395769832", "id": "270900"}, {"body": "\nImmediately walking into this place I told my girlfriend how similar the interior is to Mad Mex. Turns out its owned by the same company, Big Burrito Group. We enjoy the outside sitting option. The food, though different from Mad Mex, is much better in my opinion. I had the fish tacos and they were the best I've ever had. You can tell theyre made with fresh ingredients and handled with care. My girlfriend had the crab cake sandwhich which was very good as well, along with waffle fries crisped to perfection. Definitely one of the better restaurants the Burgh has to offer\n", "rating": -1, "title": "Mobile review", "author": "Ryan", "source": "urbanspoon", "time": "1401591931", "id": "270900"}, {"body": "\nBest waffle fries EVER!!! Kaya burger, amazing! Fish tacos, amazing. Cocktails, amazing! Great lunchtime spot!!!\n", "rating": -1, "title": "Mobile review", "author": "Tiffani Jones", "source": "urbanspoon", "time": "1408217111", "id": "270900"}, {"body": "\nGreat food, friendly staff, and you will leave stuffed, ask for a very reasonable price. Waffle fries were the best I have found to date, and the Kaya burger will keep your mouth watering for weeks\n", "rating": -1, "title": "A little spice is nice", "author": "proboard", "source": "urbanspoon", "time": "1408218140", "id": "270900"}, {"body": "\nI love your restaurant but I have one large request. Could you please go back to your old recipe for crispy calamari with coconut? I don't like the new recipe. I used to come to Kaya specifically for the old recipe. It was so delicious! Hope you'll consider this.\n", "rating": -1, "title": "Mobile review", "author": "foodpro", "source": "urbanspoon", "time": "1386452903", "id": "270900"}, {"body": "\nstaff was great- we went after a weekend day trip to the strip. it was summer but we sat indoors. the manager, a very cool West Indian female was amusing when she asked how far along I was while eyeing my cocktail. I was no where near \"along\". We split 3 sandwich/entrees so we could get a taste of each side ;-)The food was well made, the drinks were well made, the décor could have been a little \"neater\" or \"cleaner\" but still not affecting our meal. The Kaya portal says it is on the pricier side, but I would disagree, it was reasonably priced.\n", "rating": -1, "title": "amusing visit", "author": "afigluiz1", "source": "urbanspoon", "time": "1393523405", "id": "270900"}, {"body": "\nThis is my favorite restaurant in Pittsburgh. I love the vegetarian tastings they have every month. Ask for Brian-he is a fantastic server!\n", "rating": -1, "title": "My favorite", "author": "Rachel", "source": "urbanspoon", "time": "1389574534", "id": "270900"}, {"body": "\nSpend your money someplace else. Had dinner there last night. We arrived with our reservation at about 6:50 PM. We we seated promptly and given menus. One waitress gave us water and said someone would take our drink orders soon. Our waitress (Meagan) came and took our drink orders. She was cordial and said \"Would you like to know what's on my menu?\" To which I responded \"Is your menu different from this menu?\" She seemed somewhat intrigued and responded \"kind if\". We then heard the specials and nightly changes to the menu. We ordered the jerk chicken wings and ceviche. Both appetizers came quite promptly and were put on our table along with our drinks (microbrew beer and a Cosmo - well brand us Absolute). We sat there for at least 5 minutes before we could get our waitress' attention to bring us plates. Then we ordered main courses. I had grilled Salmon which was nicely cooked as desired. However underneath the Salmon were some sort of smashed oval home fries. The fries tasted like they were a day old and warmed up. The first Cosmo came as usual in a martini glass with a lime wedge (instead if a twist). The second Cosmo came with a lime twist and crushed ice - obviously two different interpretations of a well known drink recipe. The check came to just over $100.00 plus 20% tip for two each of an appetizer, alcoholic beverage and two entrees. The meal, service and drinks were only worth about 50% of that at best. The Cosmo's were just under $10 each for WELL BRAND vodka! The well brand was at least a name brand though.....I've eaten at three of the Big Burrito Group's restaurants (Soma, Kaya, Mad Mex). They are all over priced, highly decorated with fluff food that in my opinion would not fair well in any sizable city. I've lived and dined in Paris, Atlanta, Dallas, Jacksonville, and San Francisco with visits to Boston, Chicago, New York City, Washington DC, Toronto, Sydney, Auckland, Seattle, Vancouver, and many other cities. I guess I should be grateful that a modern type of restaurant such as those owned by BBG are in Pittsburgh. However, I am still confident that the older established PGH restaurants provide a much better dining experience and value. I love new ideas but also demand high quality and value.\n", "rating": -1, "title": "Mobile review", "author": "Marc Marchioli", "source": "urbanspoon", "time": "1404835453", "id": "270900"}, {"body": "\nThis place seldom disappoints. I've enjoyed pretty much everything I've had here. I particularly like the Kaya Burger. Best burger in Pittsburgh, I would say. That burger is so good it practically put me in a food coma. I had to be driven home afterward by my wife and proceeded to take a 7 hour nap. I have since recovered.\n", "rating": -1, "title": "Freakin' good", "author": "Art Vandelay", "source": "urbanspoon", "time": "1389045218", "id": "270900"}, {"body": "\nFantastic service and the food forget about it,,, you will have a fun time\n", "rating": -1, "title": "owner", "author": "moodsimage", "source": "urbanspoon", "time": "1393017643", "id": "270900"}, {"body": "\nI went to Kaya on a Sunday for brunch, we had to wait abt 15 minutes for a table of 5, which was fine because there was plenty of seating at the bar but the bartender had a bad attitude and was very rude and snobbish when we ordered our drinks. When we were seated we were warmly greeted by Tori. She more than compensated for the bartender's poor attitude. Tori had an upbeat vibe that complimented the amazing food perfectly. All our meals were excellent, we especially loved the Chocolate Chip Pancakes with mint whipped cream, the Fish Tacos, and the Eggs Benedict with smoked salmon. A+ for Tori and the food. F for the mean bartender\n", "rating": -1, "title": "Mobile review", "author": "Grace", "source": "urbanspoon", "time": "1392585219", "id": "270900"}]]